{
    "restaurants": [
        {
            "name": "The Ribbon",
            "address": "220 West 44th St",
            "rating": 4.0,
            "cuisine": "American (New)",
            "menu": [
                "Pumpkin Soup",
                "Rotisserie Chicken Soup Dinner",
                "Steamed Clams Dinner",
                "White Bean Hummus Dinner",
                "Steak Tartare Dinner",
                "Ribbon Chips Dinner",
                "Grilled Avocado Dinner",
                "Buffalo Style Cauliflower Dinner",
                "BBQ Ribs Dinner",
                "Beef Marrow and Oxtail Marmalade Dinner",
                "Baked Meatballs Dinner",
                "Tuscan White Bean Soup",
                "Housemade Flatbread Dinner",
                "Cream of Tomato Soup Dinner",
                "Housemade Chicken, Bacon & Cheddar Sausage",
                "Smoked Salmon Dinner",
                "Clothbound Cheddar",
                "Stilton Cheese",
                "Robiola Cheese",
                "Three Cheese Plate",
                "Smoked Salmon Deviled Eggs",
                "Pickled Peppers Deviled Eggs",
                "Deviled Eggs Combo Dinner",
                "Prosciutto",
                "Coppa Piccante",
                "Finociono",
                "Three Meats Plate",
                "Country Pate",
                "Chicken Liver Mousse",
                "Foie Gras Torchon",
                "House Made Pate Combo Dinner",
                "Butcher's Board Dinner",
                "Butcher's Royale Dinner",
                "Fried Oysters Deviled Eggs",
                "Butter Lettuce Salad Dinner",
                "Arugula Salad Dinner",
                "Quinoa Bowl Salad Dinner",
                "Chopped Kale and Treviso Salad Dinner",
                "Caesars Salad Dinner",
                "Beet and Goat Cheese Salad Dinner",
                "Smoked Trout Salad Dinner",
                "Half Amish Chicken Dinner",
                "Butchers Salad Dinner",
                "Prime Rib of Pork Dinner",
                "Prime Rib of Beef Dinner",
                "Vegetable Risotto Dinner",
                "Scottish Salmon Dinner",
                "Bronzino Dinner",
                "Cavatelli Dinner",
                "Mahi Mahi",
                "Lamb Chops Dinner",
                "NY Strip Steak Dinner",
                "Lobster and Shrimp Curry Dinner",
                "Braised Short Ribs Dinner",
                "The Ribbon Steak Dinner",
                "The Beef Burger Dinner",
                "The Ox Burger Dinner",
                "The Shroom Burger Dinner",
                "Black Bean Burger Dinner",
                "The Pig Club Dinner",
                "The Chicken Sandwich Dinner",
                "The Ribbon Dip Dinner",
                "Fried Chicken Sandwhich",
                "1/2 Chilled Lobster Dinner",
                "Shrimp Cocktail Dinner",
                "Fried Chicken Dinner",
                "Mashed Potato Dinner",
                "French Fries Dinner",
                "Grilled Zucchini and Thyme Dinner",
                "Wild Mushroom Roast Dinner",
                "Sauteed Broccolini Dinner",
                "Garlic and Sage Roast Fingerlings Dinner",
                "Spaetzle'n Cheese Dinner",
                "Roast Carrots Dinner",
                "Creamed Spinach Dinner",
                "Grilled Asparagus Dinner",
                "Clothbound Cheddar Lunch",
                "Stilton Cheese Lunch",
                "Robiola Cheese Lunch",
                "Three Cheese Plate Lunch",
                "Smoked Salmon Deviled Eggs",
                "Pickled Peppers Deviled Eggs",
                "Prosciutto",
                "Coppa Piccante",
                "Finochiono",
                "Three Meats Plate Lunch",
                "Butcher's Board Lunch",
                "Avocado Toast",
                "Pumpkin Soup",
                "Rotisserie Chicken Soup Lunch",
                "White Bean Hummus Lunch",
                "Shrimp Cocktail Lunch",
                "Grilled Avocado Lunch",
                "Smoked Salmon Lunch",
                "Buffalo Style Cauliflower Dinner",
                "Housemade Flatbread Lunch",
                "Pumpkin Soup",
                "Tuscan White Bean Soup Lunch",
                "Baked Meatballs Lunch",
                "Mac & Cheese Fritters",
                "Butter Lettuce Salad Lunch",
                "Arugula Salad Lunch",
                "Caesars Salad Lunch",
                "Butchers Salad Lunch",
                "Chopped Kale and Treviso Salad Lunch",
                "Quinoa Bowl Salad Lunch",
                "Smoked Trout Salad Lunch",
                "Vegetable Risotto Lunch",
                "Seared Salmon Lunch",
                "Bronzino Lunch",
                "Cavatelli Lunch",
                "Mahi Mahi",
                "Rotisserie Chicken Lunch",
                "The Ribbon Steak Lunch",
                "Vegetable Frittata",
                "Po Boy",
                "Quinoa Fried Rice",
                "The Beef Burger Lunch",
                "The Shroom Burger Lunch",
                "Black Bean Burger Lunch",
                "The Pig Club Lunch",
                "The Chicken Sandwich Lunch",
                "The Ribbon Dip Lunch",
                "Fried Chicken Sandwhich",
                "Spaetzle'n Cheese Lunch",
                "Garlic and Sage Roast Fingerlings Lunch",
                "French Fries Lunch",
                "Sauteed Broccolini Lunch",
                "Apple Strudel",
                "Chocolate Bruno",
                "Creme Fraiche Cheesecake",
                "Blue Ribbon Chocolate Chip Bread Pudding",
                "Sticky Toffee Pudding"
            ],
            "reviews": [
                "4 We dined here for lunch on Thanksgiving . We had their chicken soup which was one of the best I've ever had, a meat and cheese board which was packed with variety , arugula salad with roasted butternut squash  -delicious , prime rib french dip and although it was more well done than I'd prefer it was moist and tender . Kids food was awful unfortunately, grilled cheese cold and cheese barely melted and a horrific attempt at a kids pizza. Right into the garbage . The fries that accompany the sandwiches were very good btw.  Cocktails were spot on fabulous and the waitstaff was amazing.\nI was apprecIative for them being open and working . \n\nMy Only other complaint was a very rude , unwelcoming hostess with a higher than all mighty attitude ! She should not helping patrons who are spending good money to eat here.  Total turnoff . In the hospitality  business a hello and goodbye go along way . \nI wouldn't let it deter me from going back either .",
                "3 I was torn between a 3 and a 4 but settled on the three for one main reason: the service. The food we had was all quite good, but the service was really terrible.\n\nWe arrived for a 4:30 reservation and the place was almost empty - even in that state, I regularly had to motion for servers (that were hanging out at the serving station close to our table) before they would come over to offer drinks/take orders. \n\nIt filled up extremely quickly which didn't help the service. As a good representation, at the end of our meal a table next to us and our table teamed up promising to send the waiter to the other table to also get the check because if we didn't the server probably wouldn't help the other table for a long time. Also when walking to the bathroom, servers never attempted to get out of the way or avoid plowing through. \n\nThe short rib meal was delicious, the shrimp curry was also very good. The meat plate was very good, and the pate was just OK. The decor is also very nice and the location is excellent for going to see a play. \n\nIf you have low service standards (which is hard to do with these prices) and are seeing a play nearby and want to be close, then I think you'll enjoy your meal here.",
                "1 DON'T GO HERE!!! In the three years I've lived here, this was the worst experience I've had at any New York restaurant. \n\nI went here this past Saturday for a special HBCU event, so most of the people at the event were of color. And they treated us DEPLORABLY. They refused to let us use the bathroom upstairs and forced me to use the bathroom in the basement, which had not been serviced. It was was filthy and looked as though it had not been cleaned in months, with sanitary napkins and toilet paper all over the floors. \n\nMeanwhile, I saw several Caucasian patrons being directed to the restroom upstairs. Is this the 1960s? And toward the end of the event, the people who work at this establishment began hearding us out like sheep. It had dropped to 20 degrees outside and they wouldn't even let us stay inside to call our Uber. And their attitudes about it were awful. I felt so degraded and disrespected. And it really put a damper on the evening. \n\nI will not be returning to this restaurant/ event venue and I advise others to do the same.",
                "5 Didn't expect all that much from a theater district venue but The Ribbon proved me wrong. We were greeted by a friendly hostess and enjoyed excellent service throughout the meal including frequent water refills. Decor is funky with real leather bound books lining the walls and cool spooky Halloween decor. Comfy and inviting. \n\nStarted our pre-theater brunch off right with drinks; my orange mint mimosa and hubbie's bloody mary clocked in at $13 per and were very generous pours. I chose the burger, a monster patty of flavorful prime chopped beef blanketed with arugula, beefsteak tomatoes and savory relish. Accompanying fries were skinny, crispy and addictive. Hubbie's scrambled eggs and bacon were very good too. Decided to really sabotage our diets by sharing a hot fudge sundae afterward, several scoops of creamy vanilla ice cream slathered with hot fudge, whipped cream and crunchy pecans. The check came in at under $100 which ain't bad at all for this area. Great experience overall.",
                "5 Decent dinner options in Times Square are generally scarce, so The Ribbon is definitely a hidden gem in the area! You wouldn't think you were in the middle of a touristy hub walking in! I came here before a Broadway show, and it's also conveniently located right by some of the major theaters. \n\nI decided to order from the prix fix menu, which is a great deal for dinner! A huge fan or anything cauliflower, I started with the buffalo style cauliflower, which had a good kick to it. For my entree, I had the lobster and shrimp curry, which came with a generous helping of both lobster and shrimp. The curry itself was more coconut-based than spicy, but tasty nonetheless! The highlight, however, was the dessert - wow, the monkey bread was some of the best dessert I've had in recent months! I don't even like ice cream generally (I'm weird, I know), but it paired really well here with the warm pieces of cinnamon-y monkey bread. \n\nService was quick and efficient, as well. Solid choice overall if you're in the theater district!",
                "3 When I walked in around noon the restaurant was empty. I immediately had a bad feeling. At the 44th street location at 12 pm on a Wednesday I would assume the restaurant would be bustling with people. I took at seat at the bar to discover a very limited lunch menu. I initially wanted to go to this restaurant bc the menu looked amazing, only to be presented with a watered down version of the menu online. I order the avocado toast with poached eggs. It was average. The poached eggs were over cooked and the the avocado was just not quite ripe for my taste. I will not be returning for lunch any time soon.",
                "4 Had a nice brunch today with Violet & Mariel here. Violet had the bacon burger with fries, delicious. Mariel had the fried chicken sandwich but she felt it was tough. I had the avocado toast with poached egg on top that was delish! The mimosas were out of site too.",
                "5 Strongly recommend \nI've been to this place before the restaurant part was opened.  Only the bar downstairs and it was wonderful experience and very nice cocktails the service was excellent.  I've been wanting to try the food there and I finally had a chance. I went there for lunch and had Salad and shrimp cocktail.  Everything was excellent. They also have cocktails for $13.50 that was great price for this arI was surprised that it was quiet at lunch.  Now, I really want to go there for dinner.",
                "3 It was a Sunday and it was weird. They served us but said they have some kind of dance afternoon so we had limited seating options etc. \n\nStaff was nice. Went to the bathroom and the soap dispenser was clogged I guess and soap sprayed all over my pants. It is an open sink style where men's and women share sinks. \n\nThe food was good?  Had smoked salmon deviled eggs. The smoked salmon on the egg was amazing!  The egg was just a boiled egg with the smoked salmon on top. Deviled egg was not a good description. Had a quinoa bowl. Very very good. Had oysters and they were fresh!  Not sure I would return if given the option.",
                "5 The foie gras is fabulous!!! So good in fact I came back the next night to have it again. The roasted chicken soup with egg was just the thing before the theater. The service fast and friendly. Perfect spot pre or post show.",
                "5 I went to the Yelp elite event and it was a great experience. I'm so incredibly impressed with how gracious the staff was during a very hectic set up. Additionally, the restaurant was exceptionally generous with both the variety and availability of food. They had several drink options to choose from. The servers, hosts, and restaurant managers were friendly and inviting. They knew how to keep things moving, remain professional under pressure, and stay positive and engaged with a very large Yelp event PLUS a full restaurant on two levels. \n\nMost importantly, the food was delicious and the custom cocktail was a perfect floral sweet summertime treat. The snacks we tasted tonight were: mini avocado toast, fried cheesy crispy mushroom risotto balls, spicy buffalo cauliflower bites, burger sliders, exceptionally fresh and juicy shrimp cocktail, fancy cheese bacon sautéed greens flat bread, and baby banana bread with a dollop of fresh cream! Boy oh boy, this was such a feast!\n\nI left feeling incredibly full & happy in many ways. It's a loud space and is not for the faint of heart. If you come, be ready to talk loudly and get into a high energy mode. This place is spacious and great for an upbeat happy hour or a lively party/event. It's bustling and well situated in Times Square. Monday night here felt like a busy Thursday night at a bar in lower Manhattan! I'd like to come back for a meal but I'm curious if it slows down. \n\nBig thanks to Yelp Elite and The Ribbon for such a yummy & enjoyable experience.",
                "4 Being a New Yorker, I try to avoid times square area. Walking into The Ribbon, you completely forget you are in the busy touristy area - which was amazing. Totally didn't feel like touristy times square. \n\nReally big space. I love restaurants with high ceilings, makes it feel grand. They also have an upstairs and I believe a downstairs (blue bar.. I didn't go down there so don't have many details). Loved the big chandeliers and all of the décor.  \n\nThe menu is definitely a little pricey but the food would make the costs worth it. Also love their happy hour menu! $10 drinks? Yes please! Not to mention their happy hour starts at 8pm... most happy hours are over by 7pm. Would definitely come back for happy hour drinks with coworkers. \n\nI was here for the yelp elite event so some of the items we were served as pass arounds aren't currently on the menu, but I can say it was all DELICIOUS. Considering how many people were there, they were quick to serve and be ready to go to pass along beverages and apps with a smile on their faces. \nThe buffalo cauliflower was one of the best I've ever, so good! \nIf I have any friends in this area looking for somewhere to go, I will definitely recommend The Ribbon!",
                "4 When looking for a place near our theater, this new one came up and we especially liked the convenience of being able to walk through the passageway mid-block to get to our theater.  We had a reservation and were seated right away.  It wasn't crowded when we arrived but got more crowded before we left.  \n\nThe ambiance was quite nice-modern and subdued.  There are a lot of rooms so you don't feel like you are in a crowded place.   The prices are a bit high especially when you consider all sides are a la carte.  The sides are enough for more than one person but if only one person wants them, seems a bit pricey for it.  \n\nI had the fish which was cooked perfectly and tasted great.  It came with the skin on which came off very easily.   The mashed potatoes were nice but more than I needed.  For dessert, I had the key lime tart with Baily's ice cream.  It was really superb.  Our service was very good throughout the meal.  The price wasn't outrageous but wish they had at least one side with the main course.  The convenience to the theater was great.",
                "5 Fabulous place.\nThe food is excellent- and really pleases everyone in a large family.\nThe design of the restaurant is beautiful.\nFinally- they are great for birthdays. Brought an 8 person party here for my mother's 77th birthday- and they treated her like a queen!\nThey have a special bit (complimentary) that they do for birthday parties that is truly fun. Suffice it to say- it was a magical place!",
                "4 Came here for lunch with a few co-workers and I have to say we were pleasantly surprised. It's a relatively new venue so really, it was a maybe in terms of food. Luckily the food was on point. The service, however, needs some work. That said, no one was upset with what we are. \n\nAgain, given that this is in Times Square and it's Guy Fieri's old spot, the worry was real. Rest assured the food is good although moderately priced. We all ordered different things, but the butchers block (charcuterie board), flat bread special, and prime rib were on point. \n\nThey have a huge space so I see a perfect happy hour spot for the future. They also have a downstairs VIP area that I didn't get to use but got to check out. \n\nI'll be back. It's a rare spot in Times Square that's actually worth visiting.",
                "5 The Ribbon is a little flat...flat bread that is! Wooo is that amazing. Imagine flatbread topped with broccolini dancing with some crispy bacon on a cloud of ricotta. Definitely my fav of all I ate there. \n\nWhat I was also impressed with was the atmosphere. Classy. Open layout. And the decor felt fun and complemented the Times Square vibe. Definitely will be back for...you know it. The amazing flatbread! I'm sorry it was so good didn't catch a picture!",
                "3 My friends and I came here after Jimmys (Please don't gotta there, if you want to know why, read my other reviews)\n\nIn my years of living in NYC, I have never heard of this spot ! It has so much potential. The lighting and areas are nice. The drinks were just expensive, and the food menu on the tables weren't too great. The DJ was okay, he had his good moments and bad ones. Regardless I really do want to come back for a function that's marketed a bit better and see the outcome.\n\nAgain nice space, a jack & coke was $17 which was the same price as a Henny and cranberry . Which doesn't make much sense to me.\n\nI'm not too sure if the place was just slow and up charging drinks or that's just the norm.",
                "5 Cool new spot in Times Square. Had a burger with skinny fries (SO GOOD!) Cool atmosphere, perfect combination of family friendly and chic.",
                "5 On our first morning in NYC after a long day traveling; and a full day ahead we wanted to enjoy a great brunch - and settled on this spot.\n\nThe decor is simply amazing, beautiful lights, great aesthetics and the service from start to finish was impeccable- my water glass was full always as was our coffee.\n\nWe began with oysters- three each of East Coast and West Coast; perfectly prepared, super fresh with a delicious mignonette in which the cucumber made a difference.\n\nThen brunch - the kids enjoyed French toast and a blueberry pancake - both delicious. My husband had corn beef hash and I had an amazing avocado toast. We also tried the Bloody Mary and an orange mint mimosa.\n\nWe ended with Expresso and sorbet for the kids and very full bellies which we planned to walk off for the rest of the day.\n\nAmazing food, stunning setting and perfect service - what an amazing spot",
                "4 Great place to have dinner when seeing a show.  Close to all the theaters.  Super close to Shubert.  We shared the braised short ribs and they are really delicious.  They atmosphere was awesome, loved the decor and the service was quick and the server attentive.   The bar area seemed really large.   I know there's another location and I'm sure they are both great.",
                "4 We dined here for lunch on Thanksgiving . We had their chicken soup which was one of the best I've ever had, a meat and cheese board which was packed with variety , arugula salad with roasted butternut squash  -delicious , prime rib french dip and although it was more well done than I'd prefer it was moist and tender . Kids food was awful unfortunately, grilled cheese cold and cheese barely melted and a horrific attempt at a kids pizza. Right into the garbage . The fries that accompany the sandwiches were very good btw.  Cocktails were spot on fabulous and the waitstaff was amazing.\nI was apprecIative for them being open and working . \n\nMy Only other complaint was a very rude , unwelcoming hostess with a higher than all mighty attitude ! She should not helping patrons who are spending good money to eat here.  Total turnoff . In the hospitality  business a hello and goodbye go along way . \nI wouldn't let it deter me from going back either .",
                "3 I was torn between a 3 and a 4 but settled on the three for one main reason: the service. The food we had was all quite good, but the service was really terrible.\n\nWe arrived for a 4:30 reservation and the place was almost empty - even in that state, I regularly had to motion for servers (that were hanging out at the serving station close to our table) before they would come over to offer drinks/take orders. \n\nIt filled up extremely quickly which didn't help the service. As a good representation, at the end of our meal a table next to us and our table teamed up promising to send the waiter to the other table to also get the check because if we didn't the server probably wouldn't help the other table for a long time. Also when walking to the bathroom, servers never attempted to get out of the way or avoid plowing through. \n\nThe short rib meal was delicious, the shrimp curry was also very good. The meat plate was very good, and the pate was just OK. The decor is also very nice and the location is excellent for going to see a play. \n\nIf you have low service standards (which is hard to do with these prices) and are seeing a play nearby and want to be close, then I think you'll enjoy your meal here.",
                "1 DON'T GO HERE!!! In the three years I've lived here, this was the worst experience I've had at any New York restaurant. \n\nI went here this past Saturday for a special HBCU event, so most of the people at the event were of color. And they treated us DEPLORABLY. They refused to let us use the bathroom upstairs and forced me to use the bathroom in the basement, which had not been serviced. It was was filthy and looked as though it had not been cleaned in months, with sanitary napkins and toilet paper all over the floors. \n\nMeanwhile, I saw several Caucasian patrons being directed to the restroom upstairs. Is this the 1960s? And toward the end of the event, the people who work at this establishment began hearding us out like sheep. It had dropped to 20 degrees outside and they wouldn't even let us stay inside to call our Uber. And their attitudes about it were awful. I felt so degraded and disrespected. And it really put a damper on the evening. \n\nI will not be returning to this restaurant/ event venue and I advise others to do the same.",
                "5 Didn't expect all that much from a theater district venue but The Ribbon proved me wrong. We were greeted by a friendly hostess and enjoyed excellent service throughout the meal including frequent water refills. Decor is funky with real leather bound books lining the walls and cool spooky Halloween decor. Comfy and inviting. \n\nStarted our pre-theater brunch off right with drinks; my orange mint mimosa and hubbie's bloody mary clocked in at $13 per and were very generous pours. I chose the burger, a monster patty of flavorful prime chopped beef blanketed with arugula, beefsteak tomatoes and savory relish. Accompanying fries were skinny, crispy and addictive. Hubbie's scrambled eggs and bacon were very good too. Decided to really sabotage our diets by sharing a hot fudge sundae afterward, several scoops of creamy vanilla ice cream slathered with hot fudge, whipped cream and crunchy pecans. The check came in at under $100 which ain't bad at all for this area. Great experience overall.",
                "5 Decent dinner options in Times Square are generally scarce, so The Ribbon is definitely a hidden gem in the area! You wouldn't think you were in the middle of a touristy hub walking in! I came here before a Broadway show, and it's also conveniently located right by some of the major theaters. \n\nI decided to order from the prix fix menu, which is a great deal for dinner! A huge fan or anything cauliflower, I started with the buffalo style cauliflower, which had a good kick to it. For my entree, I had the lobster and shrimp curry, which came with a generous helping of both lobster and shrimp. The curry itself was more coconut-based than spicy, but tasty nonetheless! The highlight, however, was the dessert - wow, the monkey bread was some of the best dessert I've had in recent months! I don't even like ice cream generally (I'm weird, I know), but it paired really well here with the warm pieces of cinnamon-y monkey bread. \n\nService was quick and efficient, as well. Solid choice overall if you're in the theater district!",
                "3 When I walked in around noon the restaurant was empty. I immediately had a bad feeling. At the 44th street location at 12 pm on a Wednesday I would assume the restaurant would be bustling with people. I took at seat at the bar to discover a very limited lunch menu. I initially wanted to go to this restaurant bc the menu looked amazing, only to be presented with a watered down version of the menu online. I order the avocado toast with poached eggs. It was average. The poached eggs were over cooked and the the avocado was just not quite ripe for my taste. I will not be returning for lunch any time soon.",
                "4 Had a nice brunch today with Violet & Mariel here. Violet had the bacon burger with fries, delicious. Mariel had the fried chicken sandwich but she felt it was tough. I had the avocado toast with poached egg on top that was delish! The mimosas were out of site too.",
                "5 Strongly recommend \nI've been to this place before the restaurant part was opened.  Only the bar downstairs and it was wonderful experience and very nice cocktails the service was excellent.  I've been wanting to try the food there and I finally had a chance. I went there for lunch and had Salad and shrimp cocktail.  Everything was excellent. They also have cocktails for $13.50 that was great price for this arI was surprised that it was quiet at lunch.  Now, I really want to go there for dinner.",
                "3 It was a Sunday and it was weird. They served us but said they have some kind of dance afternoon so we had limited seating options etc. \n\nStaff was nice. Went to the bathroom and the soap dispenser was clogged I guess and soap sprayed all over my pants. It is an open sink style where men's and women share sinks. \n\nThe food was good?  Had smoked salmon deviled eggs. The smoked salmon on the egg was amazing!  The egg was just a boiled egg with the smoked salmon on top. Deviled egg was not a good description. Had a quinoa bowl. Very very good. Had oysters and they were fresh!  Not sure I would return if given the option.",
                "5 The foie gras is fabulous!!! So good in fact I came back the next night to have it again. The roasted chicken soup with egg was just the thing before the theater. The service fast and friendly. Perfect spot pre or post show.",
                "5 I went to the Yelp elite event and it was a great experience. I'm so incredibly impressed with how gracious the staff was during a very hectic set up. Additionally, the restaurant was exceptionally generous with both the variety and availability of food. They had several drink options to choose from. The servers, hosts, and restaurant managers were friendly and inviting. They knew how to keep things moving, remain professional under pressure, and stay positive and engaged with a very large Yelp event PLUS a full restaurant on two levels. \n\nMost importantly, the food was delicious and the custom cocktail was a perfect floral sweet summertime treat. The snacks we tasted tonight were: mini avocado toast, fried cheesy crispy mushroom risotto balls, spicy buffalo cauliflower bites, burger sliders, exceptionally fresh and juicy shrimp cocktail, fancy cheese bacon sautéed greens flat bread, and baby banana bread with a dollop of fresh cream! Boy oh boy, this was such a feast!\n\nI left feeling incredibly full & happy in many ways. It's a loud space and is not for the faint of heart. If you come, be ready to talk loudly and get into a high energy mode. This place is spacious and great for an upbeat happy hour or a lively party/event. It's bustling and well situated in Times Square. Monday night here felt like a busy Thursday night at a bar in lower Manhattan! I'd like to come back for a meal but I'm curious if it slows down. \n\nBig thanks to Yelp Elite and The Ribbon for such a yummy & enjoyable experience.",
                "4 Being a New Yorker, I try to avoid times square area. Walking into The Ribbon, you completely forget you are in the busy touristy area - which was amazing. Totally didn't feel like touristy times square. \n\nReally big space. I love restaurants with high ceilings, makes it feel grand. They also have an upstairs and I believe a downstairs (blue bar.. I didn't go down there so don't have many details). Loved the big chandeliers and all of the décor.  \n\nThe menu is definitely a little pricey but the food would make the costs worth it. Also love their happy hour menu! $10 drinks? Yes please! Not to mention their happy hour starts at 8pm... most happy hours are over by 7pm. Would definitely come back for happy hour drinks with coworkers. \n\nI was here for the yelp elite event so some of the items we were served as pass arounds aren't currently on the menu, but I can say it was all DELICIOUS. Considering how many people were there, they were quick to serve and be ready to go to pass along beverages and apps with a smile on their faces. \nThe buffalo cauliflower was one of the best I've ever, so good! \nIf I have any friends in this area looking for somewhere to go, I will definitely recommend The Ribbon!",
                "4 When looking for a place near our theater, this new one came up and we especially liked the convenience of being able to walk through the passageway mid-block to get to our theater.  We had a reservation and were seated right away.  It wasn't crowded when we arrived but got more crowded before we left.  \n\nThe ambiance was quite nice-modern and subdued.  There are a lot of rooms so you don't feel like you are in a crowded place.   The prices are a bit high especially when you consider all sides are a la carte.  The sides are enough for more than one person but if only one person wants them, seems a bit pricey for it.  \n\nI had the fish which was cooked perfectly and tasted great.  It came with the skin on which came off very easily.   The mashed potatoes were nice but more than I needed.  For dessert, I had the key lime tart with Baily's ice cream.  It was really superb.  Our service was very good throughout the meal.  The price wasn't outrageous but wish they had at least one side with the main course.  The convenience to the theater was great.",
                "5 Fabulous place.\nThe food is excellent- and really pleases everyone in a large family.\nThe design of the restaurant is beautiful.\nFinally- they are great for birthdays. Brought an 8 person party here for my mother's 77th birthday- and they treated her like a queen!\nThey have a special bit (complimentary) that they do for birthday parties that is truly fun. Suffice it to say- it was a magical place!",
                "4 Came here for lunch with a few co-workers and I have to say we were pleasantly surprised. It's a relatively new venue so really, it was a maybe in terms of food. Luckily the food was on point. The service, however, needs some work. That said, no one was upset with what we are. \n\nAgain, given that this is in Times Square and it's Guy Fieri's old spot, the worry was real. Rest assured the food is good although moderately priced. We all ordered different things, but the butchers block (charcuterie board), flat bread special, and prime rib were on point. \n\nThey have a huge space so I see a perfect happy hour spot for the future. They also have a downstairs VIP area that I didn't get to use but got to check out. \n\nI'll be back. It's a rare spot in Times Square that's actually worth visiting.",
                "5 The Ribbon is a little flat...flat bread that is! Wooo is that amazing. Imagine flatbread topped with broccolini dancing with some crispy bacon on a cloud of ricotta. Definitely my fav of all I ate there. \n\nWhat I was also impressed with was the atmosphere. Classy. Open layout. And the decor felt fun and complemented the Times Square vibe. Definitely will be back for...you know it. The amazing flatbread! I'm sorry it was so good didn't catch a picture!",
                "3 My friends and I came here after Jimmys (Please don't gotta there, if you want to know why, read my other reviews)\n\nIn my years of living in NYC, I have never heard of this spot ! It has so much potential. The lighting and areas are nice. The drinks were just expensive, and the food menu on the tables weren't too great. The DJ was okay, he had his good moments and bad ones. Regardless I really do want to come back for a function that's marketed a bit better and see the outcome.\n\nAgain nice space, a jack & coke was $17 which was the same price as a Henny and cranberry . Which doesn't make much sense to me.\n\nI'm not too sure if the place was just slow and up charging drinks or that's just the norm.",
                "5 Cool new spot in Times Square. Had a burger with skinny fries (SO GOOD!) Cool atmosphere, perfect combination of family friendly and chic.",
                "5 On our first morning in NYC after a long day traveling; and a full day ahead we wanted to enjoy a great brunch - and settled on this spot.\n\nThe decor is simply amazing, beautiful lights, great aesthetics and the service from start to finish was impeccable- my water glass was full always as was our coffee.\n\nWe began with oysters- three each of East Coast and West Coast; perfectly prepared, super fresh with a delicious mignonette in which the cucumber made a difference.\n\nThen brunch - the kids enjoyed French toast and a blueberry pancake - both delicious. My husband had corn beef hash and I had an amazing avocado toast. We also tried the Bloody Mary and an orange mint mimosa.\n\nWe ended with Expresso and sorbet for the kids and very full bellies which we planned to walk off for the rest of the day.\n\nAmazing food, stunning setting and perfect service - what an amazing spot",
                "4 Great place to have dinner when seeing a show.  Close to all the theaters.  Super close to Shubert.  We shared the braised short ribs and they are really delicious.  They atmosphere was awesome, loved the decor and the service was quick and the server attentive.   The bar area seemed really large.   I know there's another location and I'm sure they are both great.",
                "4 We dined here for lunch on Thanksgiving . We had their chicken soup which was one of the best I've ever had, a meat and cheese board which was packed with variety , arugula salad with roasted butternut squash  -delicious , prime rib french dip and although it was more well done than I'd prefer it was moist and tender . Kids food was awful unfortunately, grilled cheese cold and cheese barely melted and a horrific attempt at a kids pizza. Right into the garbage . The fries that accompany the sandwiches were very good btw.  Cocktails were spot on fabulous and the waitstaff was amazing.\nI was apprecIative for them being open and working . \n\nMy Only other complaint was a very rude , unwelcoming hostess with a higher than all mighty attitude ! She should not helping patrons who are spending good money to eat here.  Total turnoff . In the hospitality  business a hello and goodbye go along way . \nI wouldn't let it deter me from going back either .",
                "3 I was torn between a 3 and a 4 but settled on the three for one main reason: the service. The food we had was all quite good, but the service was really terrible.\n\nWe arrived for a 4:30 reservation and the place was almost empty - even in that state, I regularly had to motion for servers (that were hanging out at the serving station close to our table) before they would come over to offer drinks/take orders. \n\nIt filled up extremely quickly which didn't help the service. As a good representation, at the end of our meal a table next to us and our table teamed up promising to send the waiter to the other table to also get the check because if we didn't the server probably wouldn't help the other table for a long time. Also when walking to the bathroom, servers never attempted to get out of the way or avoid plowing through. \n\nThe short rib meal was delicious, the shrimp curry was also very good. The meat plate was very good, and the pate was just OK. The decor is also very nice and the location is excellent for going to see a play. \n\nIf you have low service standards (which is hard to do with these prices) and are seeing a play nearby and want to be close, then I think you'll enjoy your meal here.",
                "1 DON'T GO HERE!!! In the three years I've lived here, this was the worst experience I've had at any New York restaurant. \n\nI went here this past Saturday for a special HBCU event, so most of the people at the event were of color. And they treated us DEPLORABLY. They refused to let us use the bathroom upstairs and forced me to use the bathroom in the basement, which had not been serviced. It was was filthy and looked as though it had not been cleaned in months, with sanitary napkins and toilet paper all over the floors. \n\nMeanwhile, I saw several Caucasian patrons being directed to the restroom upstairs. Is this the 1960s? And toward the end of the event, the people who work at this establishment began hearding us out like sheep. It had dropped to 20 degrees outside and they wouldn't even let us stay inside to call our Uber. And their attitudes about it were awful. I felt so degraded and disrespected. And it really put a damper on the evening. \n\nI will not be returning to this restaurant/ event venue and I advise others to do the same.",
                "5 Didn't expect all that much from a theater district venue but The Ribbon proved me wrong. We were greeted by a friendly hostess and enjoyed excellent service throughout the meal including frequent water refills. Decor is funky with real leather bound books lining the walls and cool spooky Halloween decor. Comfy and inviting. \n\nStarted our pre-theater brunch off right with drinks; my orange mint mimosa and hubbie's bloody mary clocked in at $13 per and were very generous pours. I chose the burger, a monster patty of flavorful prime chopped beef blanketed with arugula, beefsteak tomatoes and savory relish. Accompanying fries were skinny, crispy and addictive. Hubbie's scrambled eggs and bacon were very good too. Decided to really sabotage our diets by sharing a hot fudge sundae afterward, several scoops of creamy vanilla ice cream slathered with hot fudge, whipped cream and crunchy pecans. The check came in at under $100 which ain't bad at all for this area. Great experience overall.",
                "5 Decent dinner options in Times Square are generally scarce, so The Ribbon is definitely a hidden gem in the area! You wouldn't think you were in the middle of a touristy hub walking in! I came here before a Broadway show, and it's also conveniently located right by some of the major theaters. \n\nI decided to order from the prix fix menu, which is a great deal for dinner! A huge fan or anything cauliflower, I started with the buffalo style cauliflower, which had a good kick to it. For my entree, I had the lobster and shrimp curry, which came with a generous helping of both lobster and shrimp. The curry itself was more coconut-based than spicy, but tasty nonetheless! The highlight, however, was the dessert - wow, the monkey bread was some of the best dessert I've had in recent months! I don't even like ice cream generally (I'm weird, I know), but it paired really well here with the warm pieces of cinnamon-y monkey bread. \n\nService was quick and efficient, as well. Solid choice overall if you're in the theater district!",
                "3 When I walked in around noon the restaurant was empty. I immediately had a bad feeling. At the 44th street location at 12 pm on a Wednesday I would assume the restaurant would be bustling with people. I took at seat at the bar to discover a very limited lunch menu. I initially wanted to go to this restaurant bc the menu looked amazing, only to be presented with a watered down version of the menu online. I order the avocado toast with poached eggs. It was average. The poached eggs were over cooked and the the avocado was just not quite ripe for my taste. I will not be returning for lunch any time soon.",
                "4 Had a nice brunch today with Violet & Mariel here. Violet had the bacon burger with fries, delicious. Mariel had the fried chicken sandwich but she felt it was tough. I had the avocado toast with poached egg on top that was delish! The mimosas were out of site too.",
                "5 Strongly recommend \nI've been to this place before the restaurant part was opened.  Only the bar downstairs and it was wonderful experience and very nice cocktails the service was excellent.  I've been wanting to try the food there and I finally had a chance. I went there for lunch and had Salad and shrimp cocktail.  Everything was excellent. They also have cocktails for $13.50 that was great price for this arI was surprised that it was quiet at lunch.  Now, I really want to go there for dinner.",
                "3 It was a Sunday and it was weird. They served us but said they have some kind of dance afternoon so we had limited seating options etc. \n\nStaff was nice. Went to the bathroom and the soap dispenser was clogged I guess and soap sprayed all over my pants. It is an open sink style where men's and women share sinks. \n\nThe food was good?  Had smoked salmon deviled eggs. The smoked salmon on the egg was amazing!  The egg was just a boiled egg with the smoked salmon on top. Deviled egg was not a good description. Had a quinoa bowl. Very very good. Had oysters and they were fresh!  Not sure I would return if given the option.",
                "5 The foie gras is fabulous!!! So good in fact I came back the next night to have it again. The roasted chicken soup with egg was just the thing before the theater. The service fast and friendly. Perfect spot pre or post show.",
                "5 I went to the Yelp elite event and it was a great experience. I'm so incredibly impressed with how gracious the staff was during a very hectic set up. Additionally, the restaurant was exceptionally generous with both the variety and availability of food. They had several drink options to choose from. The servers, hosts, and restaurant managers were friendly and inviting. They knew how to keep things moving, remain professional under pressure, and stay positive and engaged with a very large Yelp event PLUS a full restaurant on two levels. \n\nMost importantly, the food was delicious and the custom cocktail was a perfect floral sweet summertime treat. The snacks we tasted tonight were: mini avocado toast, fried cheesy crispy mushroom risotto balls, spicy buffalo cauliflower bites, burger sliders, exceptionally fresh and juicy shrimp cocktail, fancy cheese bacon sautéed greens flat bread, and baby banana bread with a dollop of fresh cream! Boy oh boy, this was such a feast!\n\nI left feeling incredibly full & happy in many ways. It's a loud space and is not for the faint of heart. If you come, be ready to talk loudly and get into a high energy mode. This place is spacious and great for an upbeat happy hour or a lively party/event. It's bustling and well situated in Times Square. Monday night here felt like a busy Thursday night at a bar in lower Manhattan! I'd like to come back for a meal but I'm curious if it slows down. \n\nBig thanks to Yelp Elite and The Ribbon for such a yummy & enjoyable experience.",
                "4 Being a New Yorker, I try to avoid times square area. Walking into The Ribbon, you completely forget you are in the busy touristy area - which was amazing. Totally didn't feel like touristy times square. \n\nReally big space. I love restaurants with high ceilings, makes it feel grand. They also have an upstairs and I believe a downstairs (blue bar.. I didn't go down there so don't have many details). Loved the big chandeliers and all of the décor.  \n\nThe menu is definitely a little pricey but the food would make the costs worth it. Also love their happy hour menu! $10 drinks? Yes please! Not to mention their happy hour starts at 8pm... most happy hours are over by 7pm. Would definitely come back for happy hour drinks with coworkers. \n\nI was here for the yelp elite event so some of the items we were served as pass arounds aren't currently on the menu, but I can say it was all DELICIOUS. Considering how many people were there, they were quick to serve and be ready to go to pass along beverages and apps with a smile on their faces. \nThe buffalo cauliflower was one of the best I've ever, so good! \nIf I have any friends in this area looking for somewhere to go, I will definitely recommend The Ribbon!",
                "4 When looking for a place near our theater, this new one came up and we especially liked the convenience of being able to walk through the passageway mid-block to get to our theater.  We had a reservation and were seated right away.  It wasn't crowded when we arrived but got more crowded before we left.  \n\nThe ambiance was quite nice-modern and subdued.  There are a lot of rooms so you don't feel like you are in a crowded place.   The prices are a bit high especially when you consider all sides are a la carte.  The sides are enough for more than one person but if only one person wants them, seems a bit pricey for it.  \n\nI had the fish which was cooked perfectly and tasted great.  It came with the skin on which came off very easily.   The mashed potatoes were nice but more than I needed.  For dessert, I had the key lime tart with Baily's ice cream.  It was really superb.  Our service was very good throughout the meal.  The price wasn't outrageous but wish they had at least one side with the main course.  The convenience to the theater was great.",
                "5 Fabulous place.\nThe food is excellent- and really pleases everyone in a large family.\nThe design of the restaurant is beautiful.\nFinally- they are great for birthdays. Brought an 8 person party here for my mother's 77th birthday- and they treated her like a queen!\nThey have a special bit (complimentary) that they do for birthday parties that is truly fun. Suffice it to say- it was a magical place!",
                "4 Came here for lunch with a few co-workers and I have to say we were pleasantly surprised. It's a relatively new venue so really, it was a maybe in terms of food. Luckily the food was on point. The service, however, needs some work. That said, no one was upset with what we are. \n\nAgain, given that this is in Times Square and it's Guy Fieri's old spot, the worry was real. Rest assured the food is good although moderately priced. We all ordered different things, but the butchers block (charcuterie board), flat bread special, and prime rib were on point. \n\nThey have a huge space so I see a perfect happy hour spot for the future. They also have a downstairs VIP area that I didn't get to use but got to check out. \n\nI'll be back. It's a rare spot in Times Square that's actually worth visiting.",
                "5 The Ribbon is a little flat...flat bread that is! Wooo is that amazing. Imagine flatbread topped with broccolini dancing with some crispy bacon on a cloud of ricotta. Definitely my fav of all I ate there. \n\nWhat I was also impressed with was the atmosphere. Classy. Open layout. And the decor felt fun and complemented the Times Square vibe. Definitely will be back for...you know it. The amazing flatbread! I'm sorry it was so good didn't catch a picture!",
                "3 My friends and I came here after Jimmys (Please don't gotta there, if you want to know why, read my other reviews)\n\nIn my years of living in NYC, I have never heard of this spot ! It has so much potential. The lighting and areas are nice. The drinks were just expensive, and the food menu on the tables weren't too great. The DJ was okay, he had his good moments and bad ones. Regardless I really do want to come back for a function that's marketed a bit better and see the outcome.\n\nAgain nice space, a jack & coke was $17 which was the same price as a Henny and cranberry . Which doesn't make much sense to me.\n\nI'm not too sure if the place was just slow and up charging drinks or that's just the norm.",
                "5 Cool new spot in Times Square. Had a burger with skinny fries (SO GOOD!) Cool atmosphere, perfect combination of family friendly and chic.",
                "5 On our first morning in NYC after a long day traveling; and a full day ahead we wanted to enjoy a great brunch - and settled on this spot.\n\nThe decor is simply amazing, beautiful lights, great aesthetics and the service from start to finish was impeccable- my water glass was full always as was our coffee.\n\nWe began with oysters- three each of East Coast and West Coast; perfectly prepared, super fresh with a delicious mignonette in which the cucumber made a difference.\n\nThen brunch - the kids enjoyed French toast and a blueberry pancake - both delicious. My husband had corn beef hash and I had an amazing avocado toast. We also tried the Bloody Mary and an orange mint mimosa.\n\nWe ended with Expresso and sorbet for the kids and very full bellies which we planned to walk off for the rest of the day.\n\nAmazing food, stunning setting and perfect service - what an amazing spot",
                "4 Great place to have dinner when seeing a show.  Close to all the theaters.  Super close to Shubert.  We shared the braised short ribs and they are really delicious.  They atmosphere was awesome, loved the decor and the service was quick and the server attentive.   The bar area seemed really large.   I know there's another location and I'm sure they are both great.",
                "4 We dined here for lunch on Thanksgiving . We had their chicken soup which was one of the best I've ever had, a meat and cheese board which was packed with variety , arugula salad with roasted butternut squash  -delicious , prime rib french dip and although it was more well done than I'd prefer it was moist and tender . Kids food was awful unfortunately, grilled cheese cold and cheese barely melted and a horrific attempt at a kids pizza. Right into the garbage . The fries that accompany the sandwiches were very good btw.  Cocktails were spot on fabulous and the waitstaff was amazing.\nI was apprecIative for them being open and working . \n\nMy Only other complaint was a very rude , unwelcoming hostess with a higher than all mighty attitude ! She should not helping patrons who are spending good money to eat here.  Total turnoff . In the hospitality  business a hello and goodbye go along way . \nI wouldn't let it deter me from going back either .",
                "3 I was torn between a 3 and a 4 but settled on the three for one main reason: the service. The food we had was all quite good, but the service was really terrible.\n\nWe arrived for a 4:30 reservation and the place was almost empty - even in that state, I regularly had to motion for servers (that were hanging out at the serving station close to our table) before they would come over to offer drinks/take orders. \n\nIt filled up extremely quickly which didn't help the service. As a good representation, at the end of our meal a table next to us and our table teamed up promising to send the waiter to the other table to also get the check because if we didn't the server probably wouldn't help the other table for a long time. Also when walking to the bathroom, servers never attempted to get out of the way or avoid plowing through. \n\nThe short rib meal was delicious, the shrimp curry was also very good. The meat plate was very good, and the pate was just OK. The decor is also very nice and the location is excellent for going to see a play. \n\nIf you have low service standards (which is hard to do with these prices) and are seeing a play nearby and want to be close, then I think you'll enjoy your meal here.",
                "1 DON'T GO HERE!!! In the three years I've lived here, this was the worst experience I've had at any New York restaurant. \n\nI went here this past Saturday for a special HBCU event, so most of the people at the event were of color. And they treated us DEPLORABLY. They refused to let us use the bathroom upstairs and forced me to use the bathroom in the basement, which had not been serviced. It was was filthy and looked as though it had not been cleaned in months, with sanitary napkins and toilet paper all over the floors. \n\nMeanwhile, I saw several Caucasian patrons being directed to the restroom upstairs. Is this the 1960s? And toward the end of the event, the people who work at this establishment began hearding us out like sheep. It had dropped to 20 degrees outside and they wouldn't even let us stay inside to call our Uber. And their attitudes about it were awful. I felt so degraded and disrespected. And it really put a damper on the evening. \n\nI will not be returning to this restaurant/ event venue and I advise others to do the same.",
                "5 Didn't expect all that much from a theater district venue but The Ribbon proved me wrong. We were greeted by a friendly hostess and enjoyed excellent service throughout the meal including frequent water refills. Decor is funky with real leather bound books lining the walls and cool spooky Halloween decor. Comfy and inviting. \n\nStarted our pre-theater brunch off right with drinks; my orange mint mimosa and hubbie's bloody mary clocked in at $13 per and were very generous pours. I chose the burger, a monster patty of flavorful prime chopped beef blanketed with arugula, beefsteak tomatoes and savory relish. Accompanying fries were skinny, crispy and addictive. Hubbie's scrambled eggs and bacon were very good too. Decided to really sabotage our diets by sharing a hot fudge sundae afterward, several scoops of creamy vanilla ice cream slathered with hot fudge, whipped cream and crunchy pecans. The check came in at under $100 which ain't bad at all for this area. Great experience overall.",
                "5 Decent dinner options in Times Square are generally scarce, so The Ribbon is definitely a hidden gem in the area! You wouldn't think you were in the middle of a touristy hub walking in! I came here before a Broadway show, and it's also conveniently located right by some of the major theaters. \n\nI decided to order from the prix fix menu, which is a great deal for dinner! A huge fan or anything cauliflower, I started with the buffalo style cauliflower, which had a good kick to it. For my entree, I had the lobster and shrimp curry, which came with a generous helping of both lobster and shrimp. The curry itself was more coconut-based than spicy, but tasty nonetheless! The highlight, however, was the dessert - wow, the monkey bread was some of the best dessert I've had in recent months! I don't even like ice cream generally (I'm weird, I know), but it paired really well here with the warm pieces of cinnamon-y monkey bread. \n\nService was quick and efficient, as well. Solid choice overall if you're in the theater district!",
                "3 When I walked in around noon the restaurant was empty. I immediately had a bad feeling. At the 44th street location at 12 pm on a Wednesday I would assume the restaurant would be bustling with people. I took at seat at the bar to discover a very limited lunch menu. I initially wanted to go to this restaurant bc the menu looked amazing, only to be presented with a watered down version of the menu online. I order the avocado toast with poached eggs. It was average. The poached eggs were over cooked and the the avocado was just not quite ripe for my taste. I will not be returning for lunch any time soon.",
                "4 Had a nice brunch today with Violet & Mariel here. Violet had the bacon burger with fries, delicious. Mariel had the fried chicken sandwich but she felt it was tough. I had the avocado toast with poached egg on top that was delish! The mimosas were out of site too.",
                "5 Strongly recommend \nI've been to this place before the restaurant part was opened.  Only the bar downstairs and it was wonderful experience and very nice cocktails the service was excellent.  I've been wanting to try the food there and I finally had a chance. I went there for lunch and had Salad and shrimp cocktail.  Everything was excellent. They also have cocktails for $13.50 that was great price for this arI was surprised that it was quiet at lunch.  Now, I really want to go there for dinner.",
                "3 It was a Sunday and it was weird. They served us but said they have some kind of dance afternoon so we had limited seating options etc. \n\nStaff was nice. Went to the bathroom and the soap dispenser was clogged I guess and soap sprayed all over my pants. It is an open sink style where men's and women share sinks. \n\nThe food was good?  Had smoked salmon deviled eggs. The smoked salmon on the egg was amazing!  The egg was just a boiled egg with the smoked salmon on top. Deviled egg was not a good description. Had a quinoa bowl. Very very good. Had oysters and they were fresh!  Not sure I would return if given the option.",
                "5 The foie gras is fabulous!!! So good in fact I came back the next night to have it again. The roasted chicken soup with egg was just the thing before the theater. The service fast and friendly. Perfect spot pre or post show.",
                "5 I went to the Yelp elite event and it was a great experience. I'm so incredibly impressed with how gracious the staff was during a very hectic set up. Additionally, the restaurant was exceptionally generous with both the variety and availability of food. They had several drink options to choose from. The servers, hosts, and restaurant managers were friendly and inviting. They knew how to keep things moving, remain professional under pressure, and stay positive and engaged with a very large Yelp event PLUS a full restaurant on two levels. \n\nMost importantly, the food was delicious and the custom cocktail was a perfect floral sweet summertime treat. The snacks we tasted tonight were: mini avocado toast, fried cheesy crispy mushroom risotto balls, spicy buffalo cauliflower bites, burger sliders, exceptionally fresh and juicy shrimp cocktail, fancy cheese bacon sautéed greens flat bread, and baby banana bread with a dollop of fresh cream! Boy oh boy, this was such a feast!\n\nI left feeling incredibly full & happy in many ways. It's a loud space and is not for the faint of heart. If you come, be ready to talk loudly and get into a high energy mode. This place is spacious and great for an upbeat happy hour or a lively party/event. It's bustling and well situated in Times Square. Monday night here felt like a busy Thursday night at a bar in lower Manhattan! I'd like to come back for a meal but I'm curious if it slows down. \n\nBig thanks to Yelp Elite and The Ribbon for such a yummy & enjoyable experience.",
                "4 Being a New Yorker, I try to avoid times square area. Walking into The Ribbon, you completely forget you are in the busy touristy area - which was amazing. Totally didn't feel like touristy times square. \n\nReally big space. I love restaurants with high ceilings, makes it feel grand. They also have an upstairs and I believe a downstairs (blue bar.. I didn't go down there so don't have many details). Loved the big chandeliers and all of the décor.  \n\nThe menu is definitely a little pricey but the food would make the costs worth it. Also love their happy hour menu! $10 drinks? Yes please! Not to mention their happy hour starts at 8pm... most happy hours are over by 7pm. Would definitely come back for happy hour drinks with coworkers. \n\nI was here for the yelp elite event so some of the items we were served as pass arounds aren't currently on the menu, but I can say it was all DELICIOUS. Considering how many people were there, they were quick to serve and be ready to go to pass along beverages and apps with a smile on their faces. \nThe buffalo cauliflower was one of the best I've ever, so good! \nIf I have any friends in this area looking for somewhere to go, I will definitely recommend The Ribbon!",
                "4 When looking for a place near our theater, this new one came up and we especially liked the convenience of being able to walk through the passageway mid-block to get to our theater.  We had a reservation and were seated right away.  It wasn't crowded when we arrived but got more crowded before we left.  \n\nThe ambiance was quite nice-modern and subdued.  There are a lot of rooms so you don't feel like you are in a crowded place.   The prices are a bit high especially when you consider all sides are a la carte.  The sides are enough for more than one person but if only one person wants them, seems a bit pricey for it.  \n\nI had the fish which was cooked perfectly and tasted great.  It came with the skin on which came off very easily.   The mashed potatoes were nice but more than I needed.  For dessert, I had the key lime tart with Baily's ice cream.  It was really superb.  Our service was very good throughout the meal.  The price wasn't outrageous but wish they had at least one side with the main course.  The convenience to the theater was great.",
                "5 Fabulous place.\nThe food is excellent- and really pleases everyone in a large family.\nThe design of the restaurant is beautiful.\nFinally- they are great for birthdays. Brought an 8 person party here for my mother's 77th birthday- and they treated her like a queen!\nThey have a special bit (complimentary) that they do for birthday parties that is truly fun. Suffice it to say- it was a magical place!",
                "4 Came here for lunch with a few co-workers and I have to say we were pleasantly surprised. It's a relatively new venue so really, it was a maybe in terms of food. Luckily the food was on point. The service, however, needs some work. That said, no one was upset with what we are. \n\nAgain, given that this is in Times Square and it's Guy Fieri's old spot, the worry was real. Rest assured the food is good although moderately priced. We all ordered different things, but the butchers block (charcuterie board), flat bread special, and prime rib were on point. \n\nThey have a huge space so I see a perfect happy hour spot for the future. They also have a downstairs VIP area that I didn't get to use but got to check out. \n\nI'll be back. It's a rare spot in Times Square that's actually worth visiting.",
                "5 The Ribbon is a little flat...flat bread that is! Wooo is that amazing. Imagine flatbread topped with broccolini dancing with some crispy bacon on a cloud of ricotta. Definitely my fav of all I ate there. \n\nWhat I was also impressed with was the atmosphere. Classy. Open layout. And the decor felt fun and complemented the Times Square vibe. Definitely will be back for...you know it. The amazing flatbread! I'm sorry it was so good didn't catch a picture!",
                "3 My friends and I came here after Jimmys (Please don't gotta there, if you want to know why, read my other reviews)\n\nIn my years of living in NYC, I have never heard of this spot ! It has so much potential. The lighting and areas are nice. The drinks were just expensive, and the food menu on the tables weren't too great. The DJ was okay, he had his good moments and bad ones. Regardless I really do want to come back for a function that's marketed a bit better and see the outcome.\n\nAgain nice space, a jack & coke was $17 which was the same price as a Henny and cranberry . Which doesn't make much sense to me.\n\nI'm not too sure if the place was just slow and up charging drinks or that's just the norm.",
                "5 Cool new spot in Times Square. Had a burger with skinny fries (SO GOOD!) Cool atmosphere, perfect combination of family friendly and chic.",
                "5 On our first morning in NYC after a long day traveling; and a full day ahead we wanted to enjoy a great brunch - and settled on this spot.\n\nThe decor is simply amazing, beautiful lights, great aesthetics and the service from start to finish was impeccable- my water glass was full always as was our coffee.\n\nWe began with oysters- three each of East Coast and West Coast; perfectly prepared, super fresh with a delicious mignonette in which the cucumber made a difference.\n\nThen brunch - the kids enjoyed French toast and a blueberry pancake - both delicious. My husband had corn beef hash and I had an amazing avocado toast. We also tried the Bloody Mary and an orange mint mimosa.\n\nWe ended with Expresso and sorbet for the kids and very full bellies which we planned to walk off for the rest of the day.\n\nAmazing food, stunning setting and perfect service - what an amazing spot",
                "4 Great place to have dinner when seeing a show.  Close to all the theaters.  Super close to Shubert.  We shared the braised short ribs and they are really delicious.  They atmosphere was awesome, loved the decor and the service was quick and the server attentive.   The bar area seemed really large.   I know there's another location and I'm sure they are both great.",
                "4 We dined here for lunch on Thanksgiving . We had their chicken soup which was one of the best I've ever had, a meat and cheese board which was packed with variety , arugula salad with roasted butternut squash  -delicious , prime rib french dip and although it was more well done than I'd prefer it was moist and tender . Kids food was awful unfortunately, grilled cheese cold and cheese barely melted and a horrific attempt at a kids pizza. Right into the garbage . The fries that accompany the sandwiches were very good btw.  Cocktails were spot on fabulous and the waitstaff was amazing.\nI was apprecIative for them being open and working . \n\nMy Only other complaint was a very rude , unwelcoming hostess with a higher than all mighty attitude ! She should not helping patrons who are spending good money to eat here.  Total turnoff . In the hospitality  business a hello and goodbye go along way . \nI wouldn't let it deter me from going back either .",
                "3 I was torn between a 3 and a 4 but settled on the three for one main reason: the service. The food we had was all quite good, but the service was really terrible.\n\nWe arrived for a 4:30 reservation and the place was almost empty - even in that state, I regularly had to motion for servers (that were hanging out at the serving station close to our table) before they would come over to offer drinks/take orders. \n\nIt filled up extremely quickly which didn't help the service. As a good representation, at the end of our meal a table next to us and our table teamed up promising to send the waiter to the other table to also get the check because if we didn't the server probably wouldn't help the other table for a long time. Also when walking to the bathroom, servers never attempted to get out of the way or avoid plowing through. \n\nThe short rib meal was delicious, the shrimp curry was also very good. The meat plate was very good, and the pate was just OK. The decor is also very nice and the location is excellent for going to see a play. \n\nIf you have low service standards (which is hard to do with these prices) and are seeing a play nearby and want to be close, then I think you'll enjoy your meal here.",
                "1 DON'T GO HERE!!! In the three years I've lived here, this was the worst experience I've had at any New York restaurant. \n\nI went here this past Saturday for a special HBCU event, so most of the people at the event were of color. And they treated us DEPLORABLY. They refused to let us use the bathroom upstairs and forced me to use the bathroom in the basement, which had not been serviced. It was was filthy and looked as though it had not been cleaned in months, with sanitary napkins and toilet paper all over the floors. \n\nMeanwhile, I saw several Caucasian patrons being directed to the restroom upstairs. Is this the 1960s? And toward the end of the event, the people who work at this establishment began hearding us out like sheep. It had dropped to 20 degrees outside and they wouldn't even let us stay inside to call our Uber. And their attitudes about it were awful. I felt so degraded and disrespected. And it really put a damper on the evening. \n\nI will not be returning to this restaurant/ event venue and I advise others to do the same.",
                "5 Didn't expect all that much from a theater district venue but The Ribbon proved me wrong. We were greeted by a friendly hostess and enjoyed excellent service throughout the meal including frequent water refills. Decor is funky with real leather bound books lining the walls and cool spooky Halloween decor. Comfy and inviting. \n\nStarted our pre-theater brunch off right with drinks; my orange mint mimosa and hubbie's bloody mary clocked in at $13 per and were very generous pours. I chose the burger, a monster patty of flavorful prime chopped beef blanketed with arugula, beefsteak tomatoes and savory relish. Accompanying fries were skinny, crispy and addictive. Hubbie's scrambled eggs and bacon were very good too. Decided to really sabotage our diets by sharing a hot fudge sundae afterward, several scoops of creamy vanilla ice cream slathered with hot fudge, whipped cream and crunchy pecans. The check came in at under $100 which ain't bad at all for this area. Great experience overall.",
                "5 Decent dinner options in Times Square are generally scarce, so The Ribbon is definitely a hidden gem in the area! You wouldn't think you were in the middle of a touristy hub walking in! I came here before a Broadway show, and it's also conveniently located right by some of the major theaters. \n\nI decided to order from the prix fix menu, which is a great deal for dinner! A huge fan or anything cauliflower, I started with the buffalo style cauliflower, which had a good kick to it. For my entree, I had the lobster and shrimp curry, which came with a generous helping of both lobster and shrimp. The curry itself was more coconut-based than spicy, but tasty nonetheless! The highlight, however, was the dessert - wow, the monkey bread was some of the best dessert I've had in recent months! I don't even like ice cream generally (I'm weird, I know), but it paired really well here with the warm pieces of cinnamon-y monkey bread. \n\nService was quick and efficient, as well. Solid choice overall if you're in the theater district!",
                "3 When I walked in around noon the restaurant was empty. I immediately had a bad feeling. At the 44th street location at 12 pm on a Wednesday I would assume the restaurant would be bustling with people. I took at seat at the bar to discover a very limited lunch menu. I initially wanted to go to this restaurant bc the menu looked amazing, only to be presented with a watered down version of the menu online. I order the avocado toast with poached eggs. It was average. The poached eggs were over cooked and the the avocado was just not quite ripe for my taste. I will not be returning for lunch any time soon.",
                "4 Had a nice brunch today with Violet & Mariel here. Violet had the bacon burger with fries, delicious. Mariel had the fried chicken sandwich but she felt it was tough. I had the avocado toast with poached egg on top that was delish! The mimosas were out of site too.",
                "5 Strongly recommend \nI've been to this place before the restaurant part was opened.  Only the bar downstairs and it was wonderful experience and very nice cocktails the service was excellent.  I've been wanting to try the food there and I finally had a chance. I went there for lunch and had Salad and shrimp cocktail.  Everything was excellent. They also have cocktails for $13.50 that was great price for this arI was surprised that it was quiet at lunch.  Now, I really want to go there for dinner.",
                "3 It was a Sunday and it was weird. They served us but said they have some kind of dance afternoon so we had limited seating options etc. \n\nStaff was nice. Went to the bathroom and the soap dispenser was clogged I guess and soap sprayed all over my pants. It is an open sink style where men's and women share sinks. \n\nThe food was good?  Had smoked salmon deviled eggs. The smoked salmon on the egg was amazing!  The egg was just a boiled egg with the smoked salmon on top. Deviled egg was not a good description. Had a quinoa bowl. Very very good. Had oysters and they were fresh!  Not sure I would return if given the option.",
                "5 The foie gras is fabulous!!! So good in fact I came back the next night to have it again. The roasted chicken soup with egg was just the thing before the theater. The service fast and friendly. Perfect spot pre or post show.",
                "5 I went to the Yelp elite event and it was a great experience. I'm so incredibly impressed with how gracious the staff was during a very hectic set up. Additionally, the restaurant was exceptionally generous with both the variety and availability of food. They had several drink options to choose from. The servers, hosts, and restaurant managers were friendly and inviting. They knew how to keep things moving, remain professional under pressure, and stay positive and engaged with a very large Yelp event PLUS a full restaurant on two levels. \n\nMost importantly, the food was delicious and the custom cocktail was a perfect floral sweet summertime treat. The snacks we tasted tonight were: mini avocado toast, fried cheesy crispy mushroom risotto balls, spicy buffalo cauliflower bites, burger sliders, exceptionally fresh and juicy shrimp cocktail, fancy cheese bacon sautéed greens flat bread, and baby banana bread with a dollop of fresh cream! Boy oh boy, this was such a feast!\n\nI left feeling incredibly full & happy in many ways. It's a loud space and is not for the faint of heart. If you come, be ready to talk loudly and get into a high energy mode. This place is spacious and great for an upbeat happy hour or a lively party/event. It's bustling and well situated in Times Square. Monday night here felt like a busy Thursday night at a bar in lower Manhattan! I'd like to come back for a meal but I'm curious if it slows down. \n\nBig thanks to Yelp Elite and The Ribbon for such a yummy & enjoyable experience.",
                "4 Being a New Yorker, I try to avoid times square area. Walking into The Ribbon, you completely forget you are in the busy touristy area - which was amazing. Totally didn't feel like touristy times square. \n\nReally big space. I love restaurants with high ceilings, makes it feel grand. They also have an upstairs and I believe a downstairs (blue bar.. I didn't go down there so don't have many details). Loved the big chandeliers and all of the décor.  \n\nThe menu is definitely a little pricey but the food would make the costs worth it. Also love their happy hour menu! $10 drinks? Yes please! Not to mention their happy hour starts at 8pm... most happy hours are over by 7pm. Would definitely come back for happy hour drinks with coworkers. \n\nI was here for the yelp elite event so some of the items we were served as pass arounds aren't currently on the menu, but I can say it was all DELICIOUS. Considering how many people were there, they were quick to serve and be ready to go to pass along beverages and apps with a smile on their faces. \nThe buffalo cauliflower was one of the best I've ever, so good! \nIf I have any friends in this area looking for somewhere to go, I will definitely recommend The Ribbon!",
                "4 When looking for a place near our theater, this new one came up and we especially liked the convenience of being able to walk through the passageway mid-block to get to our theater.  We had a reservation and were seated right away.  It wasn't crowded when we arrived but got more crowded before we left.  \n\nThe ambiance was quite nice-modern and subdued.  There are a lot of rooms so you don't feel like you are in a crowded place.   The prices are a bit high especially when you consider all sides are a la carte.  The sides are enough for more than one person but if only one person wants them, seems a bit pricey for it.  \n\nI had the fish which was cooked perfectly and tasted great.  It came with the skin on which came off very easily.   The mashed potatoes were nice but more than I needed.  For dessert, I had the key lime tart with Baily's ice cream.  It was really superb.  Our service was very good throughout the meal.  The price wasn't outrageous but wish they had at least one side with the main course.  The convenience to the theater was great.",
                "5 Fabulous place.\nThe food is excellent- and really pleases everyone in a large family.\nThe design of the restaurant is beautiful.\nFinally- they are great for birthdays. Brought an 8 person party here for my mother's 77th birthday- and they treated her like a queen!\nThey have a special bit (complimentary) that they do for birthday parties that is truly fun. Suffice it to say- it was a magical place!",
                "4 Came here for lunch with a few co-workers and I have to say we were pleasantly surprised. It's a relatively new venue so really, it was a maybe in terms of food. Luckily the food was on point. The service, however, needs some work. That said, no one was upset with what we are. \n\nAgain, given that this is in Times Square and it's Guy Fieri's old spot, the worry was real. Rest assured the food is good although moderately priced. We all ordered different things, but the butchers block (charcuterie board), flat bread special, and prime rib were on point. \n\nThey have a huge space so I see a perfect happy hour spot for the future. They also have a downstairs VIP area that I didn't get to use but got to check out. \n\nI'll be back. It's a rare spot in Times Square that's actually worth visiting.",
                "5 The Ribbon is a little flat...flat bread that is! Wooo is that amazing. Imagine flatbread topped with broccolini dancing with some crispy bacon on a cloud of ricotta. Definitely my fav of all I ate there. \n\nWhat I was also impressed with was the atmosphere. Classy. Open layout. And the decor felt fun and complemented the Times Square vibe. Definitely will be back for...you know it. The amazing flatbread! I'm sorry it was so good didn't catch a picture!",
                "3 My friends and I came here after Jimmys (Please don't gotta there, if you want to know why, read my other reviews)\n\nIn my years of living in NYC, I have never heard of this spot ! It has so much potential. The lighting and areas are nice. The drinks were just expensive, and the food menu on the tables weren't too great. The DJ was okay, he had his good moments and bad ones. Regardless I really do want to come back for a function that's marketed a bit better and see the outcome.\n\nAgain nice space, a jack & coke was $17 which was the same price as a Henny and cranberry . Which doesn't make much sense to me.\n\nI'm not too sure if the place was just slow and up charging drinks or that's just the norm.",
                "5 Cool new spot in Times Square. Had a burger with skinny fries (SO GOOD!) Cool atmosphere, perfect combination of family friendly and chic.",
                "5 On our first morning in NYC after a long day traveling; and a full day ahead we wanted to enjoy a great brunch - and settled on this spot.\n\nThe decor is simply amazing, beautiful lights, great aesthetics and the service from start to finish was impeccable- my water glass was full always as was our coffee.\n\nWe began with oysters- three each of East Coast and West Coast; perfectly prepared, super fresh with a delicious mignonette in which the cucumber made a difference.\n\nThen brunch - the kids enjoyed French toast and a blueberry pancake - both delicious. My husband had corn beef hash and I had an amazing avocado toast. We also tried the Bloody Mary and an orange mint mimosa.\n\nWe ended with Expresso and sorbet for the kids and very full bellies which we planned to walk off for the rest of the day.\n\nAmazing food, stunning setting and perfect service - what an amazing spot",
                "4 Great place to have dinner when seeing a show.  Close to all the theaters.  Super close to Shubert.  We shared the braised short ribs and they are really delicious.  They atmosphere was awesome, loved the decor and the service was quick and the server attentive.   The bar area seemed really large.   I know there's another location and I'm sure they are both great.",
                "4 We dined here for lunch on Thanksgiving . We had their chicken soup which was one of the best I've ever had, a meat and cheese board which was packed with variety , arugula salad with roasted butternut squash  -delicious , prime rib french dip and although it was more well done than I'd prefer it was moist and tender . Kids food was awful unfortunately, grilled cheese cold and cheese barely melted and a horrific attempt at a kids pizza. Right into the garbage . The fries that accompany the sandwiches were very good btw.  Cocktails were spot on fabulous and the waitstaff was amazing.\nI was apprecIative for them being open and working . \n\nMy Only other complaint was a very rude , unwelcoming hostess with a higher than all mighty attitude ! She should not helping patrons who are spending good money to eat here.  Total turnoff . In the hospitality  business a hello and goodbye go along way . \nI wouldn't let it deter me from going back either .",
                "3 I was torn between a 3 and a 4 but settled on the three for one main reason: the service. The food we had was all quite good, but the service was really terrible.\n\nWe arrived for a 4:30 reservation and the place was almost empty - even in that state, I regularly had to motion for servers (that were hanging out at the serving station close to our table) before they would come over to offer drinks/take orders. \n\nIt filled up extremely quickly which didn't help the service. As a good representation, at the end of our meal a table next to us and our table teamed up promising to send the waiter to the other table to also get the check because if we didn't the server probably wouldn't help the other table for a long time. Also when walking to the bathroom, servers never attempted to get out of the way or avoid plowing through. \n\nThe short rib meal was delicious, the shrimp curry was also very good. The meat plate was very good, and the pate was just OK. The decor is also very nice and the location is excellent for going to see a play. \n\nIf you have low service standards (which is hard to do with these prices) and are seeing a play nearby and want to be close, then I think you'll enjoy your meal here.",
                "1 DON'T GO HERE!!! In the three years I've lived here, this was the worst experience I've had at any New York restaurant. \n\nI went here this past Saturday for a special HBCU event, so most of the people at the event were of color. And they treated us DEPLORABLY. They refused to let us use the bathroom upstairs and forced me to use the bathroom in the basement, which had not been serviced. It was was filthy and looked as though it had not been cleaned in months, with sanitary napkins and toilet paper all over the floors. \n\nMeanwhile, I saw several Caucasian patrons being directed to the restroom upstairs. Is this the 1960s? And toward the end of the event, the people who work at this establishment began hearding us out like sheep. It had dropped to 20 degrees outside and they wouldn't even let us stay inside to call our Uber. And their attitudes about it were awful. I felt so degraded and disrespected. And it really put a damper on the evening. \n\nI will not be returning to this restaurant/ event venue and I advise others to do the same.",
                "5 Didn't expect all that much from a theater district venue but The Ribbon proved me wrong. We were greeted by a friendly hostess and enjoyed excellent service throughout the meal including frequent water refills. Decor is funky with real leather bound books lining the walls and cool spooky Halloween decor. Comfy and inviting. \n\nStarted our pre-theater brunch off right with drinks; my orange mint mimosa and hubbie's bloody mary clocked in at $13 per and were very generous pours. I chose the burger, a monster patty of flavorful prime chopped beef blanketed with arugula, beefsteak tomatoes and savory relish. Accompanying fries were skinny, crispy and addictive. Hubbie's scrambled eggs and bacon were very good too. Decided to really sabotage our diets by sharing a hot fudge sundae afterward, several scoops of creamy vanilla ice cream slathered with hot fudge, whipped cream and crunchy pecans. The check came in at under $100 which ain't bad at all for this area. Great experience overall.",
                "5 Decent dinner options in Times Square are generally scarce, so The Ribbon is definitely a hidden gem in the area! You wouldn't think you were in the middle of a touristy hub walking in! I came here before a Broadway show, and it's also conveniently located right by some of the major theaters. \n\nI decided to order from the prix fix menu, which is a great deal for dinner! A huge fan or anything cauliflower, I started with the buffalo style cauliflower, which had a good kick to it. For my entree, I had the lobster and shrimp curry, which came with a generous helping of both lobster and shrimp. The curry itself was more coconut-based than spicy, but tasty nonetheless! The highlight, however, was the dessert - wow, the monkey bread was some of the best dessert I've had in recent months! I don't even like ice cream generally (I'm weird, I know), but it paired really well here with the warm pieces of cinnamon-y monkey bread. \n\nService was quick and efficient, as well. Solid choice overall if you're in the theater district!",
                "3 When I walked in around noon the restaurant was empty. I immediately had a bad feeling. At the 44th street location at 12 pm on a Wednesday I would assume the restaurant would be bustling with people. I took at seat at the bar to discover a very limited lunch menu. I initially wanted to go to this restaurant bc the menu looked amazing, only to be presented with a watered down version of the menu online. I order the avocado toast with poached eggs. It was average. The poached eggs were over cooked and the the avocado was just not quite ripe for my taste. I will not be returning for lunch any time soon.",
                "4 Had a nice brunch today with Violet & Mariel here. Violet had the bacon burger with fries, delicious. Mariel had the fried chicken sandwich but she felt it was tough. I had the avocado toast with poached egg on top that was delish! The mimosas were out of site too.",
                "5 Strongly recommend \nI've been to this place before the restaurant part was opened.  Only the bar downstairs and it was wonderful experience and very nice cocktails the service was excellent.  I've been wanting to try the food there and I finally had a chance. I went there for lunch and had Salad and shrimp cocktail.  Everything was excellent. They also have cocktails for $13.50 that was great price for this arI was surprised that it was quiet at lunch.  Now, I really want to go there for dinner.",
                "3 It was a Sunday and it was weird. They served us but said they have some kind of dance afternoon so we had limited seating options etc. \n\nStaff was nice. Went to the bathroom and the soap dispenser was clogged I guess and soap sprayed all over my pants. It is an open sink style where men's and women share sinks. \n\nThe food was good?  Had smoked salmon deviled eggs. The smoked salmon on the egg was amazing!  The egg was just a boiled egg with the smoked salmon on top. Deviled egg was not a good description. Had a quinoa bowl. Very very good. Had oysters and they were fresh!  Not sure I would return if given the option.",
                "5 The foie gras is fabulous!!! So good in fact I came back the next night to have it again. The roasted chicken soup with egg was just the thing before the theater. The service fast and friendly. Perfect spot pre or post show.",
                "5 I went to the Yelp elite event and it was a great experience. I'm so incredibly impressed with how gracious the staff was during a very hectic set up. Additionally, the restaurant was exceptionally generous with both the variety and availability of food. They had several drink options to choose from. The servers, hosts, and restaurant managers were friendly and inviting. They knew how to keep things moving, remain professional under pressure, and stay positive and engaged with a very large Yelp event PLUS a full restaurant on two levels. \n\nMost importantly, the food was delicious and the custom cocktail was a perfect floral sweet summertime treat. The snacks we tasted tonight were: mini avocado toast, fried cheesy crispy mushroom risotto balls, spicy buffalo cauliflower bites, burger sliders, exceptionally fresh and juicy shrimp cocktail, fancy cheese bacon sautéed greens flat bread, and baby banana bread with a dollop of fresh cream! Boy oh boy, this was such a feast!\n\nI left feeling incredibly full & happy in many ways. It's a loud space and is not for the faint of heart. If you come, be ready to talk loudly and get into a high energy mode. This place is spacious and great for an upbeat happy hour or a lively party/event. It's bustling and well situated in Times Square. Monday night here felt like a busy Thursday night at a bar in lower Manhattan! I'd like to come back for a meal but I'm curious if it slows down. \n\nBig thanks to Yelp Elite and The Ribbon for such a yummy & enjoyable experience.",
                "4 Being a New Yorker, I try to avoid times square area. Walking into The Ribbon, you completely forget you are in the busy touristy area - which was amazing. Totally didn't feel like touristy times square. \n\nReally big space. I love restaurants with high ceilings, makes it feel grand. They also have an upstairs and I believe a downstairs (blue bar.. I didn't go down there so don't have many details). Loved the big chandeliers and all of the décor.  \n\nThe menu is definitely a little pricey but the food would make the costs worth it. Also love their happy hour menu! $10 drinks? Yes please! Not to mention their happy hour starts at 8pm... most happy hours are over by 7pm. Would definitely come back for happy hour drinks with coworkers. \n\nI was here for the yelp elite event so some of the items we were served as pass arounds aren't currently on the menu, but I can say it was all DELICIOUS. Considering how many people were there, they were quick to serve and be ready to go to pass along beverages and apps with a smile on their faces. \nThe buffalo cauliflower was one of the best I've ever, so good! \nIf I have any friends in this area looking for somewhere to go, I will definitely recommend The Ribbon!",
                "4 When looking for a place near our theater, this new one came up and we especially liked the convenience of being able to walk through the passageway mid-block to get to our theater.  We had a reservation and were seated right away.  It wasn't crowded when we arrived but got more crowded before we left.  \n\nThe ambiance was quite nice-modern and subdued.  There are a lot of rooms so you don't feel like you are in a crowded place.   The prices are a bit high especially when you consider all sides are a la carte.  The sides are enough for more than one person but if only one person wants them, seems a bit pricey for it.  \n\nI had the fish which was cooked perfectly and tasted great.  It came with the skin on which came off very easily.   The mashed potatoes were nice but more than I needed.  For dessert, I had the key lime tart with Baily's ice cream.  It was really superb.  Our service was very good throughout the meal.  The price wasn't outrageous but wish they had at least one side with the main course.  The convenience to the theater was great.",
                "5 Fabulous place.\nThe food is excellent- and really pleases everyone in a large family.\nThe design of the restaurant is beautiful.\nFinally- they are great for birthdays. Brought an 8 person party here for my mother's 77th birthday- and they treated her like a queen!\nThey have a special bit (complimentary) that they do for birthday parties that is truly fun. Suffice it to say- it was a magical place!",
                "4 Came here for lunch with a few co-workers and I have to say we were pleasantly surprised. It's a relatively new venue so really, it was a maybe in terms of food. Luckily the food was on point. The service, however, needs some work. That said, no one was upset with what we are. \n\nAgain, given that this is in Times Square and it's Guy Fieri's old spot, the worry was real. Rest assured the food is good although moderately priced. We all ordered different things, but the butchers block (charcuterie board), flat bread special, and prime rib were on point. \n\nThey have a huge space so I see a perfect happy hour spot for the future. They also have a downstairs VIP area that I didn't get to use but got to check out. \n\nI'll be back. It's a rare spot in Times Square that's actually worth visiting.",
                "5 The Ribbon is a little flat...flat bread that is! Wooo is that amazing. Imagine flatbread topped with broccolini dancing with some crispy bacon on a cloud of ricotta. Definitely my fav of all I ate there. \n\nWhat I was also impressed with was the atmosphere. Classy. Open layout. And the decor felt fun and complemented the Times Square vibe. Definitely will be back for...you know it. The amazing flatbread! I'm sorry it was so good didn't catch a picture!",
                "3 My friends and I came here after Jimmys (Please don't gotta there, if you want to know why, read my other reviews)\n\nIn my years of living in NYC, I have never heard of this spot ! It has so much potential. The lighting and areas are nice. The drinks were just expensive, and the food menu on the tables weren't too great. The DJ was okay, he had his good moments and bad ones. Regardless I really do want to come back for a function that's marketed a bit better and see the outcome.\n\nAgain nice space, a jack & coke was $17 which was the same price as a Henny and cranberry . Which doesn't make much sense to me.\n\nI'm not too sure if the place was just slow and up charging drinks or that's just the norm.",
                "5 Cool new spot in Times Square. Had a burger with skinny fries (SO GOOD!) Cool atmosphere, perfect combination of family friendly and chic.",
                "5 On our first morning in NYC after a long day traveling; and a full day ahead we wanted to enjoy a great brunch - and settled on this spot.\n\nThe decor is simply amazing, beautiful lights, great aesthetics and the service from start to finish was impeccable- my water glass was full always as was our coffee.\n\nWe began with oysters- three each of East Coast and West Coast; perfectly prepared, super fresh with a delicious mignonette in which the cucumber made a difference.\n\nThen brunch - the kids enjoyed French toast and a blueberry pancake - both delicious. My husband had corn beef hash and I had an amazing avocado toast. We also tried the Bloody Mary and an orange mint mimosa.\n\nWe ended with Expresso and sorbet for the kids and very full bellies which we planned to walk off for the rest of the day.\n\nAmazing food, stunning setting and perfect service - what an amazing spot",
                "4 Great place to have dinner when seeing a show.  Close to all the theaters.  Super close to Shubert.  We shared the braised short ribs and they are really delicious.  They atmosphere was awesome, loved the decor and the service was quick and the server attentive.   The bar area seemed really large.   I know there's another location and I'm sure they are both great."
            ]
        },
        {
            "name": "Ipanema Restaurant",
            "address": "43 W 46th St",
            "rating": 4.0,
            "cuisine": "Brazilian",
            "menu": [
                "Pao de Queijo",
                "Churrasco Gaucho",
                "Brigadeiro e Beijinho",
                "Gambas a Mocambique",
                "Salgadinhos Sortidos",
                "Camarao a Guilho",
                "Abacate Recheado",
                "Linguica e Mandioquinha",
                "Lulas Fritas Com Molho de Manga",
                "Pao de Queijo",
                "Abacate Recheado",
                "Camarao a Guilho",
                "Pasteis",
                "Linguica e Mandioca",
                "Lulas Empanadas",
                "Salgadinhos",
                "Caldo Verde Sopa",
                "Creme de Camarao Sopa",
                "Banana Frita",
                "Vegetais",
                "Couve",
                "Pure de Batata",
                "Batata Frita",
                "Aspargos",
                "Malho do Bitoque",
                "Chimichurri",
                "Vinaigrette",
                "Batata Doce",
                "Batata Do Chef",
                "Cogumelos",
                "Salada Ipanema",
                "Salada de Polvo",
                "Salada de Palmito",
                "Salada Carioca",
                "Picanha",
                "Fraldinha com Chimichurri",
                "Churrasco Ipanema",
                "Churrasco Misto",
                "Churrasco Gaucho",
                "Bife Oswaldo Aranha",
                "Bitoque",
                "Feijoada Completa",
                "Camarao no Coco",
                "Paelha",
                "Camarao Empanado",
                "Mariscada Algarvia",
                "Vatapa",
                "Paelha Negra",
                "Salmao Grelhado",
                "Robalo Grelhado",
                "Bacalhau a Bras",
                "Atum Crustado",
                "Polvo a Lagareiro",
                "Bitoque",
                "Vatapa",
                "Feijoada Completa",
                "Strogonoff de Palmito",
                "Berinjela Parmigiana",
                "Frango Grelhado",
                "Frango com Banana e Queijo",
                "Strogonoff de Frango",
                "Gambas a Mocambique Lunch",
                "Salgadinhos Sortidos Lunch",
                "Camarao a Guilho Lunch",
                "Abacate Recheado Lunch",
                "Linguica e Mandioquinha Lunch",
                "Lulas Fritas Com Molho de Manga Lunch",
                "Pao de Queijo Lunch",
                "Abacate Recheado Lunch",
                "Camarao a Guilho Lunch",
                "Pasteis Lunch",
                "Linguica e Mandioca Lunch",
                "Lulas Empanadas Lunch",
                "Salgadinhos Lunch",
                "O Eusebio Sandwich Lunch",
                "O Pele Sandwich Lunch",
                "Prego no Pao Sandwich Lunch",
                "Banana Frita Lunch",
                "Vegetais Lunch",
                "Couve Lunch",
                "Pure de Batata Lunch",
                "Batata Frita Lunch",
                "Aspargos Lunch",
                "Batata Do Chef Lunch",
                "Cogumelos Lunch",
                "Batata Doce Lunch",
                "Salada Ipanema Lunch",
                "Salada de Polvo Lunch",
                "Salada Carioca Lunch",
                "Salada de Palmito Lunch",
                "Caldo Verde Sopa Lunch",
                "Creme de Camarao Lunch",
                "Picanha Lunch",
                "Fraldinha com Chimichurri Lunch",
                "Churrasco Ipanema Lunch",
                "Churrasco Misto Lunch",
                "Churrasco Gaucho Lunch",
                "Bife Oswaldo Aranha Lunch",
                "Bitoque Lunch",
                "Feijoada Completa Lunch",
                "Vatapa Lunch",
                "Camarao No Coco Lunch",
                "Mariscada Algarvia Lunch",
                "Paella Negra Lunch",
                "Massada de Peixe Lunch",
                "Camarao Panado Lunch",
                "Paella Lunch",
                "Camarao no Coco Lunch",
                "Paelha Lunch",
                "Camarao Empanado Lunch",
                "Mariscada Algarvia Lunch",
                "Salmao Grelhado Lunch",
                "Robalo Grelhado Lunch",
                "Bacalhau a Bras Lunch",
                "Atum Crustado Lunch",
                "Polvo a Lagareiro Lunch",
                "Bitoque Lunch",
                "Vatapa Lunch",
                "Feijoada Completa Lunch",
                "Strogonoff de Palmito Lunch",
                "Berinjela Parmigiana Lunch",
                "Frango Grelhado Lunch",
                "Frango com Banana e Queijo Lunch",
                "Strogonoff de Frango Lunch",
                "Doce da Casa",
                "Brigadeiro e Beijinho",
                "Tres Leches",
                "Mousse de Chocolate",
                "Manjar de Coco",
                "Pudim de Leite",
                "Mousse de Maracuja",
                "Banana Gulosa",
                "Pastel de Nata",
                "Cafe Bom Bom",
                "Cafezinho",
                "Machiatto",
                "Double Cafezinho",
                "Espresso",
                "Coffee",
                "Iced Coffee",
                "Latte",
                "Hot Tea",
                "Cappuccino",
                "Guarana",
                "Sumol"
            ],
            "reviews": [
                "5 I came here for my birthday dinner with a party of 6 and it was amazing! I wanted to do a dinner somewhere in the city and wanted ACTUAL good food over instagrammable places...did a little research on yelp and this place did not disappoint. \n\nFirst off, all the waiters/service were prompt and friendly. Upon learning it was my birthday, our server (not so discretely) asked my friend what my name was (stay with me it gets better). \n\nDinner was great, some friends got their most popular dish, the bitoque. I got the Churrasco Ipanema, and the melted cheese on top of the strip was honestly the cherry on top. In terms of drinks, I got the Ipanema cocktail (lime and passionfruit caipirinha). I'm biased because passionfruit is my all time favorite fruit, but that was the best cocktail I've ever had. \n\nAfter dinner cleared out, my friends surprised me with a cake (thanks guys!). After THAT, our server came in with a slice of flan and a bunch of them sang happy birthday in Portuguese to me...BUT THEY FORGOT MY NAME. Everyone had a good laugh at that. \n\nAll in all, a great birthday dinner experience with amazing food and service!! I'll be back for that cocktail!",
                "5 Wow! Amazing! \nI'm impressed with the food and the staff. Everybody was so nice and attentive.\nYou really have to try the Coxinhas and the Chicken Strogonoff was the best one I ever ate. Matheus is one of the best waiters ever! And as a dessert you guys really have to try the caramel flan.",
                "2 To be quite honest, I was not impressed. It is not the best Brazilian food that I've ever had in quality or flavor. \n\nVery quickly, it seemed that this restaurant is much more concerned with pumping through tables in volume than catering to them in quality. It was probably too close to Times Square, and I should've known better. Based on the reviews, I expected more.\n\nEverything for the food was dry like it had been sitting in a pot or under a lamp for quite a while. We got one drink from the bar. One cup of water each, and we were never offered anything additional to eat or drink. \n\nIt filled the void in our stomachs. With so many other options in Manhattan, I would recommend looking up one of them that is not within walking distance of Times Square, or chances are you will be equally as disappointed. \n\nIf you're just in need of an okay place or in a time crunch, this will fit the bill.",
                "4 Little hole in the wall of busy Times Square. Steak was juicy but a little tough. Mine was very cheesy (yum), but could've used more crab on top. Black beans were tasty. The fried bananas are a must! Side portion comes with 4 - so crispy and sweet. Sangria was A+ with tons of fruit and in a large mason jar. Decent service, romantic atmosphere. Prices are high, but would return.",
                "5 Excellent service and food. Went here with a Brazilian friend and this place did not disappoint. The feijoada was delicious and served with all the trimmings - chili peppers, rice, greens, a salty breadcrumb preparation and oranges. It was a feast and we shared one pot between the two of us. We also got assorted croquettes and shrimp in garlic sauce which were both delicious. The bread they provide is chewy and makes a great scoop for all the sauces. Recommend this place for a taste of Brazilian cuisine.",
                "3 Just came back from Vacation in Portugal and had extreme depression and was craving a pasteis de Nata. When I was in Portugal I would have like 2 to 3 a day (it's fine I did a lot of walking don't judge me). First order of business was to find a place near my job to get my fix. This place was about walking distance. \n\nI ordered an order of pasteis and an espresso on seamless . The pasteis is about 10$ and comes in 3. Unfortunately when I arrived to pick up they told me they don't do espresso to go...so I had to sit at the bar and chug my espresso then walk back to my office to eat my treats and that wasn't really the vibe I was going for. The pasteis were pretty good...obviously not the same and I get it but I got it out of my system.",
                "4 *WOULD RECOMMEND*\n\n\n\nWe visited Ipanema during 4th of July weekend before our broadway show and it was a good choice. The restaurant is two stories with a nice interior.The waiters were all very friendly and taught us how to pronounce some of the dishes. The menu was relatively small but all the food looked really good. I've never had Brazilian/Portuguese food (besides steak) but it all looks quite authentic to me. Their hot sauce is TO DIE FOR! It is homemade with fresh chilies, vinegar, and a lot of other ingredients I cannot pronounce. It started off a bit sweet and sour, followed by a kick of spice.I love sour so this hot sauce is right up my alley. The waiter even packed me a container of the hot sauce to take home. Service 10/10! \n\n*DINNER*\nPao de queijo - cheese bread. I thought it was going to be gooey, but it was actually was fluffy. I think they mixed the cheese into the dough. It was quite light and tasted very good with the hot sauce.\n\nPaelha - Brazilian/Portuguese version of paella. It had fresh clams, mussles, shrimp, chicken, sausage, and scallops, with a side of black bean sauce. All the seafood was fresh, especially the scallops (it was so tender). The rice itself didn't have as much depth in flavor as I'd hope. My friends all said they had better.\n\nFeijoada completa - national Brazilian dish. Basically black bean stew with a variety of meat and different sides (greens, breadcrumbs, and orange). The meat was alright, but the really dark looking one (I'm not sure which one that was) was really good. The combination of the stew with the sides was not bad. However, I do think there was a bit too much black bean to my liking. \n\nFlan - quite dense but pretty good\n\n\n*VERDICT*\nI would go back again and try their other food. This was just an introduction to Brazilian/Portuguese food for me outside of just steak.",
                "5 I don't think I knew how steak really was supposed to taste until today at Ipanema Restaurant. I've been to many restaurants, and been ok with their steak, \"the usual\" but these guys are something else. It was my first time there, so it was a bit difficult to read their menu. Luckily, Cadu helped me, and recommended nothing but the best steak I've ever tasted. Great customer service by Cadu. 10 stars for him.",
                "5 Easy same night dinner reservation, classy yet casual fun dining environment, and impeccable service that was professional, friendly, and efficient. Food and drinks that were unique and phenomenally flavorful in a creative comfort food where Mom loads too much on your plate sort of way.\n       My husband and I are glad we dined here for our first night in NYC dinner date ahead of a busy walking and Broadway itinerary day 2. We wish we'd had time for a second fabulous meal on our short first two day NYC visit. \n      The food and specialty drinks were so good! We hope to return and will recommend a meal here to any family members, friends, or acquaintances visiting NYC.",
                "4 Overall decent experience, I went here with a friend who recommended this place for lunch on a weekday afternoon.  The place had about 1-2 other tables with customers but later on in the evening more people came in, especially to the bar.\n\nComplimentary bread and butter was given at the beginning.  For the meal we had the Picanha which consisted of 3 pieces of a picanha cut of beef (a sort of special cut known in churrascarias that is known for a ring of fat lining the steak), rice, black beans. farofa (nutty flour mixture), fried potatoe coins, and a tangy salsa (not sure what it was called exactly but it helped brightened up the dish).  The picanha was well seasoned.  We also ordered the Churrasco Gaucho, which is another beef dish that came with fried potatoes.\n\nService was ok, we were seated immediately and the waitress asked if it's our first time eating, went over the specials, and asked if she can help answer any questions.  Water was refilled promptly (though a bit awkward since the waiter would hover around us for a few minutes before asking us for the refills).",
                "4 First time trying Portuguese and finding an authentic Brazilian/Portuguese restaurant that offers a great ambiance that's a little more upscale than the typical is sometimes hard to find even in New York. \n\nMy picanha was amazing, cooked perfectly the sauce was perfect and tasted home made. The Caipirinha and Sangria a plus!  \n\nFor dessert my friend and I shared and of course we had to try the Brazilian flan and Pasteis de Nata. One specialty of each country: Brazil and Portugal. And both were flavorful and well served and the flan was pretty big enough for two.\n\nThe staff is all very nice and welcoming. Love this place!",
                "1 This one hurts to write. I've been to Ipanema a few times and, frankly, always had a great experience with great food.\n\nToday started out no different - my wife and I went and had some good pao de queijo, picanha, bacalhau, rice and beans, etc. - the good stuff you want from a Brazilian restaurant.\n\nWe ordered dessert and the brigadeiros were not great - stale and frozen, so we sent them back and the waiter took them off our check. No biggie. \n\nWhere it all goes awry is later. We get home and my wife opens her leftover bacalhau and starts nomming. During mid-bite, a roach-like bug crawls out of the food (see the pic). That's just disgusting. Wife spits out her food, my stomach second-guesses what we ate today. Makes you wonder what kind of ingredients are in the food, if you catch my drift. Kitchen needs an inspection and we will never eat here again, and can only hope others take heed of our advice. Ugh. That sucked.",
                "5 This is a favorite for my family and I. We're Portuguese and finding an authentic Brazilian/Portuguese restaurant that offers a great ambience that's a little more upscale than the typical is sometimes hard. My picanha was amazing, cooked perfectly, my dad loved his polvo, my mom and bf also loved their bitoque, the sauce was perfect and tasted home made. The Cartuxa wine was great, along with the caipirinha and sangria! For dessert we had the pastéis de nata, doce da casa (my personal favorite), and tres leches. The waiter was funny and very interactive. The staff is all very nice and welcoming. Love this place!!",
                "4 To start, things went terribly. There was lipstick on my friends water glass when we sat down (spoiler alert, it wasn't hers) and the bread they serve might be the worst bread I have ever had at a restaurant. Not only that, but the butter packets they serve with it might be the worst butter packets I have ever had as well. I thought to myself uh oh, this will be terrible. \n\nBut after that things got better. Our service was fairly quick and we both enjoyed our food. My friend got the bitoque and I got the vatapa. Both were tasty and we both enjoyed ourselves. We got their fried bananas which neither of us liked. Too fried and not tasty. I wouldn't order it again. But their flan dessert was amazing. It was a great texture and just delightful. I really recommend the flan - star of the night. \n\nQuick service and good food, just improve the bread and the sanitary aspect for 5 stars. Seriously about the bread, don't have bread if it's going to be that poor of quality. I really hope they read this so they stop with that.",
                "5 I dined here once while in NYC for a three day work trip, and I'm very glad I made it one of my three dinners in a city with hundreds of food options. First of all, I can very rarely find a restaurant in the United States that serves Super Bock on draft. I really enjoyed having this beer in Portugal last May but haven't had it since. This drink made the meal start off great. \n\nFor food, I will warn you to skip an appetizer if you aren't hungry. Our entrees came with a side of white rice and black beans. I'm not sure if this is typical. We were hungry, however, so we got the empanadas as an appetizer. My favorite was the cheese stuffed one, though the others were quite good too. Seemingly everything on the menu caught my eye, but when I asked our fantastic waiter for a recommendation between the few dishes I was considering, he recommended the bitoque. This is one of the restaurant's three \"classic\" dishes, and wow am I glad he pointed me in that direction. Though it wasn't the best steak I've ever had prepared, the garlic beer sauce was to die for. I used the potatoes that came with the dish as well as the black beans and white rice to soak up every bit of sauce. \n\nIf I'm back in the city any time soon, I would certianly consider going back to Ipanema. The great food, beer, and service (which I realize now I didn't mention before, but it was incredible) made for an excellent experience.",
                "5 I've eaten at Ipanema in Little Brazil the last two times my wife and I attended a Broadway show and both times it was excellent in both service and food. Of our two visits below is what I'd highly recommend you try...\n\nDrinks: Caipirinhas\nAppetizer: Pasteis\nEntree: Fraldinha, and/or Camarao Empanado",
                "4 Prices very reasonable for NYC. Atmosphere more like a diner however and noisy, service with Gabby so far so good. Classic Brazilian steak, picanha and skirt steak both recommended by Gabby, and she was right. Empanadas with heart-of-palm were quite delightful, beef ones too salty. The stuffed avocado with crab was OK, big portion. Margarita was so-so, not the place to order one, but they tried to make it right. House cabs both very good, Voces Cellars, CA was excellent at low price for city at $17/glass. Service was good, food was good, prices reasonable, what's not to like... I'd come back, but there are 1000 more restaurants to try first in NYC, but probably less than 500 in close walking distance from hotel :-)",
                "5 This place was fantastic! It was my first time ever having Brazilian food. I'm still thinking about it. My dish was so unique. I ordered the Bitoque, which was a New York strip steak with an egg on top, surrounded by a garlic beer sauce and fries. The steak was really good, not the best I've had, but it was cooked really well and had alot of juicy flavor. The sauce was amazing and tasted so much like brown gravy. It soaked really well with the fries. I was in garlic heaven eating this. The portion size was humongous but of course I finished everything because it was so good. My friend enjoyed her steak dinner too. We were pretty stuffed at the end. I wanted to try the Brazilian cheese bread but for the two of us, it came with too much bread since we already got complimentary bread service. I've heard it's a classic Brazilian thing so I hope to one day come back and try. The service was excellent, my water was always being refilled and we were treated very nicely by all waitstaff. I highly recommend this restaurant!",
                "4 The CHURRASCO IPANEMA is sooo good!\n\nWe made reservations for a weekend evening which I would recommend doing. The restaurant has clean modern look. Its dimly lit and has a bar right in front with a large dining area in the back and up the stairs.\n\nService is good. Our water glasses were constantly kept full and our orders were taken right away and food came out quick. \n\nI got the Churrasco ipanema which was a perfectly cooked medium rare NY strip topped with a good portion of shrimp and grab meat and delicious melted cheese. A really decadent surf and turf that taste amazing. I really enjoyed how light the while dish was. you would think its too much but the steak is seasoned perfectly and the crab shrimp cheese topping was surprisingly light. \n\nI'd definitely recommend giving this steak a try!",
                "5 If you are looking for a great Brazilian restaurant, head over to Ipanema. You will not be disappointed in any way. The food is incredible! We started with mixed salgadinhos (empanadas), which were delicious. We ordered The Picanha steak and the Vatapá ( shrimp in coconut  milk and palm oil), which was my absolute favorite.\nWhile the food was incredible, the service was beyond belief. My husband is from Rio, but our guests had never tried Brazilian food. Our waiter, Cadu, was amazing! So attentive, patient and informative, he really made our night.\nThanks to the entire staff for an incredible evening. We felt like family.",
                "5 I came here for my birthday dinner with a party of 6 and it was amazing! I wanted to do a dinner somewhere in the city and wanted ACTUAL good food over instagrammable places...did a little research on yelp and this place did not disappoint. \n\nFirst off, all the waiters/service were prompt and friendly. Upon learning it was my birthday, our server (not so discretely) asked my friend what my name was (stay with me it gets better). \n\nDinner was great, some friends got their most popular dish, the bitoque. I got the Churrasco Ipanema, and the melted cheese on top of the strip was honestly the cherry on top. In terms of drinks, I got the Ipanema cocktail (lime and passionfruit caipirinha). I'm biased because passionfruit is my all time favorite fruit, but that was the best cocktail I've ever had. \n\nAfter dinner cleared out, my friends surprised me with a cake (thanks guys!). After THAT, our server came in with a slice of flan and a bunch of them sang happy birthday in Portuguese to me...BUT THEY FORGOT MY NAME. Everyone had a good laugh at that. \n\nAll in all, a great birthday dinner experience with amazing food and service!! I'll be back for that cocktail!",
                "5 Wow! Amazing! \nI'm impressed with the food and the staff. Everybody was so nice and attentive.\nYou really have to try the Coxinhas and the Chicken Strogonoff was the best one I ever ate. Matheus is one of the best waiters ever! And as a dessert you guys really have to try the caramel flan.",
                "2 To be quite honest, I was not impressed. It is not the best Brazilian food that I've ever had in quality or flavor. \n\nVery quickly, it seemed that this restaurant is much more concerned with pumping through tables in volume than catering to them in quality. It was probably too close to Times Square, and I should've known better. Based on the reviews, I expected more.\n\nEverything for the food was dry like it had been sitting in a pot or under a lamp for quite a while. We got one drink from the bar. One cup of water each, and we were never offered anything additional to eat or drink. \n\nIt filled the void in our stomachs. With so many other options in Manhattan, I would recommend looking up one of them that is not within walking distance of Times Square, or chances are you will be equally as disappointed. \n\nIf you're just in need of an okay place or in a time crunch, this will fit the bill.",
                "4 Little hole in the wall of busy Times Square. Steak was juicy but a little tough. Mine was very cheesy (yum), but could've used more crab on top. Black beans were tasty. The fried bananas are a must! Side portion comes with 4 - so crispy and sweet. Sangria was A+ with tons of fruit and in a large mason jar. Decent service, romantic atmosphere. Prices are high, but would return.",
                "5 Excellent service and food. Went here with a Brazilian friend and this place did not disappoint. The feijoada was delicious and served with all the trimmings - chili peppers, rice, greens, a salty breadcrumb preparation and oranges. It was a feast and we shared one pot between the two of us. We also got assorted croquettes and shrimp in garlic sauce which were both delicious. The bread they provide is chewy and makes a great scoop for all the sauces. Recommend this place for a taste of Brazilian cuisine.",
                "3 Just came back from Vacation in Portugal and had extreme depression and was craving a pasteis de Nata. When I was in Portugal I would have like 2 to 3 a day (it's fine I did a lot of walking don't judge me). First order of business was to find a place near my job to get my fix. This place was about walking distance. \n\nI ordered an order of pasteis and an espresso on seamless . The pasteis is about 10$ and comes in 3. Unfortunately when I arrived to pick up they told me they don't do espresso to go...so I had to sit at the bar and chug my espresso then walk back to my office to eat my treats and that wasn't really the vibe I was going for. The pasteis were pretty good...obviously not the same and I get it but I got it out of my system.",
                "4 *WOULD RECOMMEND*\n\n\n\nWe visited Ipanema during 4th of July weekend before our broadway show and it was a good choice. The restaurant is two stories with a nice interior.The waiters were all very friendly and taught us how to pronounce some of the dishes. The menu was relatively small but all the food looked really good. I've never had Brazilian/Portuguese food (besides steak) but it all looks quite authentic to me. Their hot sauce is TO DIE FOR! It is homemade with fresh chilies, vinegar, and a lot of other ingredients I cannot pronounce. It started off a bit sweet and sour, followed by a kick of spice.I love sour so this hot sauce is right up my alley. The waiter even packed me a container of the hot sauce to take home. Service 10/10! \n\n*DINNER*\nPao de queijo - cheese bread. I thought it was going to be gooey, but it was actually was fluffy. I think they mixed the cheese into the dough. It was quite light and tasted very good with the hot sauce.\n\nPaelha - Brazilian/Portuguese version of paella. It had fresh clams, mussles, shrimp, chicken, sausage, and scallops, with a side of black bean sauce. All the seafood was fresh, especially the scallops (it was so tender). The rice itself didn't have as much depth in flavor as I'd hope. My friends all said they had better.\n\nFeijoada completa - national Brazilian dish. Basically black bean stew with a variety of meat and different sides (greens, breadcrumbs, and orange). The meat was alright, but the really dark looking one (I'm not sure which one that was) was really good. The combination of the stew with the sides was not bad. However, I do think there was a bit too much black bean to my liking. \n\nFlan - quite dense but pretty good\n\n\n*VERDICT*\nI would go back again and try their other food. This was just an introduction to Brazilian/Portuguese food for me outside of just steak.",
                "5 I don't think I knew how steak really was supposed to taste until today at Ipanema Restaurant. I've been to many restaurants, and been ok with their steak, \"the usual\" but these guys are something else. It was my first time there, so it was a bit difficult to read their menu. Luckily, Cadu helped me, and recommended nothing but the best steak I've ever tasted. Great customer service by Cadu. 10 stars for him.",
                "5 Easy same night dinner reservation, classy yet casual fun dining environment, and impeccable service that was professional, friendly, and efficient. Food and drinks that were unique and phenomenally flavorful in a creative comfort food where Mom loads too much on your plate sort of way.\n       My husband and I are glad we dined here for our first night in NYC dinner date ahead of a busy walking and Broadway itinerary day 2. We wish we'd had time for a second fabulous meal on our short first two day NYC visit. \n      The food and specialty drinks were so good! We hope to return and will recommend a meal here to any family members, friends, or acquaintances visiting NYC.",
                "4 Overall decent experience, I went here with a friend who recommended this place for lunch on a weekday afternoon.  The place had about 1-2 other tables with customers but later on in the evening more people came in, especially to the bar.\n\nComplimentary bread and butter was given at the beginning.  For the meal we had the Picanha which consisted of 3 pieces of a picanha cut of beef (a sort of special cut known in churrascarias that is known for a ring of fat lining the steak), rice, black beans. farofa (nutty flour mixture), fried potatoe coins, and a tangy salsa (not sure what it was called exactly but it helped brightened up the dish).  The picanha was well seasoned.  We also ordered the Churrasco Gaucho, which is another beef dish that came with fried potatoes.\n\nService was ok, we were seated immediately and the waitress asked if it's our first time eating, went over the specials, and asked if she can help answer any questions.  Water was refilled promptly (though a bit awkward since the waiter would hover around us for a few minutes before asking us for the refills).",
                "4 First time trying Portuguese and finding an authentic Brazilian/Portuguese restaurant that offers a great ambiance that's a little more upscale than the typical is sometimes hard to find even in New York. \n\nMy picanha was amazing, cooked perfectly the sauce was perfect and tasted home made. The Caipirinha and Sangria a plus!  \n\nFor dessert my friend and I shared and of course we had to try the Brazilian flan and Pasteis de Nata. One specialty of each country: Brazil and Portugal. And both were flavorful and well served and the flan was pretty big enough for two.\n\nThe staff is all very nice and welcoming. Love this place!",
                "1 This one hurts to write. I've been to Ipanema a few times and, frankly, always had a great experience with great food.\n\nToday started out no different - my wife and I went and had some good pao de queijo, picanha, bacalhau, rice and beans, etc. - the good stuff you want from a Brazilian restaurant.\n\nWe ordered dessert and the brigadeiros were not great - stale and frozen, so we sent them back and the waiter took them off our check. No biggie. \n\nWhere it all goes awry is later. We get home and my wife opens her leftover bacalhau and starts nomming. During mid-bite, a roach-like bug crawls out of the food (see the pic). That's just disgusting. Wife spits out her food, my stomach second-guesses what we ate today. Makes you wonder what kind of ingredients are in the food, if you catch my drift. Kitchen needs an inspection and we will never eat here again, and can only hope others take heed of our advice. Ugh. That sucked.",
                "5 This is a favorite for my family and I. We're Portuguese and finding an authentic Brazilian/Portuguese restaurant that offers a great ambience that's a little more upscale than the typical is sometimes hard. My picanha was amazing, cooked perfectly, my dad loved his polvo, my mom and bf also loved their bitoque, the sauce was perfect and tasted home made. The Cartuxa wine was great, along with the caipirinha and sangria! For dessert we had the pastéis de nata, doce da casa (my personal favorite), and tres leches. The waiter was funny and very interactive. The staff is all very nice and welcoming. Love this place!!",
                "4 To start, things went terribly. There was lipstick on my friends water glass when we sat down (spoiler alert, it wasn't hers) and the bread they serve might be the worst bread I have ever had at a restaurant. Not only that, but the butter packets they serve with it might be the worst butter packets I have ever had as well. I thought to myself uh oh, this will be terrible. \n\nBut after that things got better. Our service was fairly quick and we both enjoyed our food. My friend got the bitoque and I got the vatapa. Both were tasty and we both enjoyed ourselves. We got their fried bananas which neither of us liked. Too fried and not tasty. I wouldn't order it again. But their flan dessert was amazing. It was a great texture and just delightful. I really recommend the flan - star of the night. \n\nQuick service and good food, just improve the bread and the sanitary aspect for 5 stars. Seriously about the bread, don't have bread if it's going to be that poor of quality. I really hope they read this so they stop with that.",
                "5 I dined here once while in NYC for a three day work trip, and I'm very glad I made it one of my three dinners in a city with hundreds of food options. First of all, I can very rarely find a restaurant in the United States that serves Super Bock on draft. I really enjoyed having this beer in Portugal last May but haven't had it since. This drink made the meal start off great. \n\nFor food, I will warn you to skip an appetizer if you aren't hungry. Our entrees came with a side of white rice and black beans. I'm not sure if this is typical. We were hungry, however, so we got the empanadas as an appetizer. My favorite was the cheese stuffed one, though the others were quite good too. Seemingly everything on the menu caught my eye, but when I asked our fantastic waiter for a recommendation between the few dishes I was considering, he recommended the bitoque. This is one of the restaurant's three \"classic\" dishes, and wow am I glad he pointed me in that direction. Though it wasn't the best steak I've ever had prepared, the garlic beer sauce was to die for. I used the potatoes that came with the dish as well as the black beans and white rice to soak up every bit of sauce. \n\nIf I'm back in the city any time soon, I would certianly consider going back to Ipanema. The great food, beer, and service (which I realize now I didn't mention before, but it was incredible) made for an excellent experience.",
                "5 I've eaten at Ipanema in Little Brazil the last two times my wife and I attended a Broadway show and both times it was excellent in both service and food. Of our two visits below is what I'd highly recommend you try...\n\nDrinks: Caipirinhas\nAppetizer: Pasteis\nEntree: Fraldinha, and/or Camarao Empanado",
                "4 Prices very reasonable for NYC. Atmosphere more like a diner however and noisy, service with Gabby so far so good. Classic Brazilian steak, picanha and skirt steak both recommended by Gabby, and she was right. Empanadas with heart-of-palm were quite delightful, beef ones too salty. The stuffed avocado with crab was OK, big portion. Margarita was so-so, not the place to order one, but they tried to make it right. House cabs both very good, Voces Cellars, CA was excellent at low price for city at $17/glass. Service was good, food was good, prices reasonable, what's not to like... I'd come back, but there are 1000 more restaurants to try first in NYC, but probably less than 500 in close walking distance from hotel :-)",
                "5 This place was fantastic! It was my first time ever having Brazilian food. I'm still thinking about it. My dish was so unique. I ordered the Bitoque, which was a New York strip steak with an egg on top, surrounded by a garlic beer sauce and fries. The steak was really good, not the best I've had, but it was cooked really well and had alot of juicy flavor. The sauce was amazing and tasted so much like brown gravy. It soaked really well with the fries. I was in garlic heaven eating this. The portion size was humongous but of course I finished everything because it was so good. My friend enjoyed her steak dinner too. We were pretty stuffed at the end. I wanted to try the Brazilian cheese bread but for the two of us, it came with too much bread since we already got complimentary bread service. I've heard it's a classic Brazilian thing so I hope to one day come back and try. The service was excellent, my water was always being refilled and we were treated very nicely by all waitstaff. I highly recommend this restaurant!",
                "4 The CHURRASCO IPANEMA is sooo good!\n\nWe made reservations for a weekend evening which I would recommend doing. The restaurant has clean modern look. Its dimly lit and has a bar right in front with a large dining area in the back and up the stairs.\n\nService is good. Our water glasses were constantly kept full and our orders were taken right away and food came out quick. \n\nI got the Churrasco ipanema which was a perfectly cooked medium rare NY strip topped with a good portion of shrimp and grab meat and delicious melted cheese. A really decadent surf and turf that taste amazing. I really enjoyed how light the while dish was. you would think its too much but the steak is seasoned perfectly and the crab shrimp cheese topping was surprisingly light. \n\nI'd definitely recommend giving this steak a try!",
                "5 If you are looking for a great Brazilian restaurant, head over to Ipanema. You will not be disappointed in any way. The food is incredible! We started with mixed salgadinhos (empanadas), which were delicious. We ordered The Picanha steak and the Vatapá ( shrimp in coconut  milk and palm oil), which was my absolute favorite.\nWhile the food was incredible, the service was beyond belief. My husband is from Rio, but our guests had never tried Brazilian food. Our waiter, Cadu, was amazing! So attentive, patient and informative, he really made our night.\nThanks to the entire staff for an incredible evening. We felt like family.",
                "5 I came here for my birthday dinner with a party of 6 and it was amazing! I wanted to do a dinner somewhere in the city and wanted ACTUAL good food over instagrammable places...did a little research on yelp and this place did not disappoint. \n\nFirst off, all the waiters/service were prompt and friendly. Upon learning it was my birthday, our server (not so discretely) asked my friend what my name was (stay with me it gets better). \n\nDinner was great, some friends got their most popular dish, the bitoque. I got the Churrasco Ipanema, and the melted cheese on top of the strip was honestly the cherry on top. In terms of drinks, I got the Ipanema cocktail (lime and passionfruit caipirinha). I'm biased because passionfruit is my all time favorite fruit, but that was the best cocktail I've ever had. \n\nAfter dinner cleared out, my friends surprised me with a cake (thanks guys!). After THAT, our server came in with a slice of flan and a bunch of them sang happy birthday in Portuguese to me...BUT THEY FORGOT MY NAME. Everyone had a good laugh at that. \n\nAll in all, a great birthday dinner experience with amazing food and service!! I'll be back for that cocktail!",
                "5 Wow! Amazing! \nI'm impressed with the food and the staff. Everybody was so nice and attentive.\nYou really have to try the Coxinhas and the Chicken Strogonoff was the best one I ever ate. Matheus is one of the best waiters ever! And as a dessert you guys really have to try the caramel flan.",
                "2 To be quite honest, I was not impressed. It is not the best Brazilian food that I've ever had in quality or flavor. \n\nVery quickly, it seemed that this restaurant is much more concerned with pumping through tables in volume than catering to them in quality. It was probably too close to Times Square, and I should've known better. Based on the reviews, I expected more.\n\nEverything for the food was dry like it had been sitting in a pot or under a lamp for quite a while. We got one drink from the bar. One cup of water each, and we were never offered anything additional to eat or drink. \n\nIt filled the void in our stomachs. With so many other options in Manhattan, I would recommend looking up one of them that is not within walking distance of Times Square, or chances are you will be equally as disappointed. \n\nIf you're just in need of an okay place or in a time crunch, this will fit the bill.",
                "4 Little hole in the wall of busy Times Square. Steak was juicy but a little tough. Mine was very cheesy (yum), but could've used more crab on top. Black beans were tasty. The fried bananas are a must! Side portion comes with 4 - so crispy and sweet. Sangria was A+ with tons of fruit and in a large mason jar. Decent service, romantic atmosphere. Prices are high, but would return.",
                "5 Excellent service and food. Went here with a Brazilian friend and this place did not disappoint. The feijoada was delicious and served with all the trimmings - chili peppers, rice, greens, a salty breadcrumb preparation and oranges. It was a feast and we shared one pot between the two of us. We also got assorted croquettes and shrimp in garlic sauce which were both delicious. The bread they provide is chewy and makes a great scoop for all the sauces. Recommend this place for a taste of Brazilian cuisine.",
                "3 Just came back from Vacation in Portugal and had extreme depression and was craving a pasteis de Nata. When I was in Portugal I would have like 2 to 3 a day (it's fine I did a lot of walking don't judge me). First order of business was to find a place near my job to get my fix. This place was about walking distance. \n\nI ordered an order of pasteis and an espresso on seamless . The pasteis is about 10$ and comes in 3. Unfortunately when I arrived to pick up they told me they don't do espresso to go...so I had to sit at the bar and chug my espresso then walk back to my office to eat my treats and that wasn't really the vibe I was going for. The pasteis were pretty good...obviously not the same and I get it but I got it out of my system.",
                "4 *WOULD RECOMMEND*\n\n\n\nWe visited Ipanema during 4th of July weekend before our broadway show and it was a good choice. The restaurant is two stories with a nice interior.The waiters were all very friendly and taught us how to pronounce some of the dishes. The menu was relatively small but all the food looked really good. I've never had Brazilian/Portuguese food (besides steak) but it all looks quite authentic to me. Their hot sauce is TO DIE FOR! It is homemade with fresh chilies, vinegar, and a lot of other ingredients I cannot pronounce. It started off a bit sweet and sour, followed by a kick of spice.I love sour so this hot sauce is right up my alley. The waiter even packed me a container of the hot sauce to take home. Service 10/10! \n\n*DINNER*\nPao de queijo - cheese bread. I thought it was going to be gooey, but it was actually was fluffy. I think they mixed the cheese into the dough. It was quite light and tasted very good with the hot sauce.\n\nPaelha - Brazilian/Portuguese version of paella. It had fresh clams, mussles, shrimp, chicken, sausage, and scallops, with a side of black bean sauce. All the seafood was fresh, especially the scallops (it was so tender). The rice itself didn't have as much depth in flavor as I'd hope. My friends all said they had better.\n\nFeijoada completa - national Brazilian dish. Basically black bean stew with a variety of meat and different sides (greens, breadcrumbs, and orange). The meat was alright, but the really dark looking one (I'm not sure which one that was) was really good. The combination of the stew with the sides was not bad. However, I do think there was a bit too much black bean to my liking. \n\nFlan - quite dense but pretty good\n\n\n*VERDICT*\nI would go back again and try their other food. This was just an introduction to Brazilian/Portuguese food for me outside of just steak.",
                "5 I don't think I knew how steak really was supposed to taste until today at Ipanema Restaurant. I've been to many restaurants, and been ok with their steak, \"the usual\" but these guys are something else. It was my first time there, so it was a bit difficult to read their menu. Luckily, Cadu helped me, and recommended nothing but the best steak I've ever tasted. Great customer service by Cadu. 10 stars for him.",
                "5 Easy same night dinner reservation, classy yet casual fun dining environment, and impeccable service that was professional, friendly, and efficient. Food and drinks that were unique and phenomenally flavorful in a creative comfort food where Mom loads too much on your plate sort of way.\n       My husband and I are glad we dined here for our first night in NYC dinner date ahead of a busy walking and Broadway itinerary day 2. We wish we'd had time for a second fabulous meal on our short first two day NYC visit. \n      The food and specialty drinks were so good! We hope to return and will recommend a meal here to any family members, friends, or acquaintances visiting NYC.",
                "4 Overall decent experience, I went here with a friend who recommended this place for lunch on a weekday afternoon.  The place had about 1-2 other tables with customers but later on in the evening more people came in, especially to the bar.\n\nComplimentary bread and butter was given at the beginning.  For the meal we had the Picanha which consisted of 3 pieces of a picanha cut of beef (a sort of special cut known in churrascarias that is known for a ring of fat lining the steak), rice, black beans. farofa (nutty flour mixture), fried potatoe coins, and a tangy salsa (not sure what it was called exactly but it helped brightened up the dish).  The picanha was well seasoned.  We also ordered the Churrasco Gaucho, which is another beef dish that came with fried potatoes.\n\nService was ok, we were seated immediately and the waitress asked if it's our first time eating, went over the specials, and asked if she can help answer any questions.  Water was refilled promptly (though a bit awkward since the waiter would hover around us for a few minutes before asking us for the refills).",
                "4 First time trying Portuguese and finding an authentic Brazilian/Portuguese restaurant that offers a great ambiance that's a little more upscale than the typical is sometimes hard to find even in New York. \n\nMy picanha was amazing, cooked perfectly the sauce was perfect and tasted home made. The Caipirinha and Sangria a plus!  \n\nFor dessert my friend and I shared and of course we had to try the Brazilian flan and Pasteis de Nata. One specialty of each country: Brazil and Portugal. And both were flavorful and well served and the flan was pretty big enough for two.\n\nThe staff is all very nice and welcoming. Love this place!",
                "1 This one hurts to write. I've been to Ipanema a few times and, frankly, always had a great experience with great food.\n\nToday started out no different - my wife and I went and had some good pao de queijo, picanha, bacalhau, rice and beans, etc. - the good stuff you want from a Brazilian restaurant.\n\nWe ordered dessert and the brigadeiros were not great - stale and frozen, so we sent them back and the waiter took them off our check. No biggie. \n\nWhere it all goes awry is later. We get home and my wife opens her leftover bacalhau and starts nomming. During mid-bite, a roach-like bug crawls out of the food (see the pic). That's just disgusting. Wife spits out her food, my stomach second-guesses what we ate today. Makes you wonder what kind of ingredients are in the food, if you catch my drift. Kitchen needs an inspection and we will never eat here again, and can only hope others take heed of our advice. Ugh. That sucked.",
                "5 This is a favorite for my family and I. We're Portuguese and finding an authentic Brazilian/Portuguese restaurant that offers a great ambience that's a little more upscale than the typical is sometimes hard. My picanha was amazing, cooked perfectly, my dad loved his polvo, my mom and bf also loved their bitoque, the sauce was perfect and tasted home made. The Cartuxa wine was great, along with the caipirinha and sangria! For dessert we had the pastéis de nata, doce da casa (my personal favorite), and tres leches. The waiter was funny and very interactive. The staff is all very nice and welcoming. Love this place!!",
                "4 To start, things went terribly. There was lipstick on my friends water glass when we sat down (spoiler alert, it wasn't hers) and the bread they serve might be the worst bread I have ever had at a restaurant. Not only that, but the butter packets they serve with it might be the worst butter packets I have ever had as well. I thought to myself uh oh, this will be terrible. \n\nBut after that things got better. Our service was fairly quick and we both enjoyed our food. My friend got the bitoque and I got the vatapa. Both were tasty and we both enjoyed ourselves. We got their fried bananas which neither of us liked. Too fried and not tasty. I wouldn't order it again. But their flan dessert was amazing. It was a great texture and just delightful. I really recommend the flan - star of the night. \n\nQuick service and good food, just improve the bread and the sanitary aspect for 5 stars. Seriously about the bread, don't have bread if it's going to be that poor of quality. I really hope they read this so they stop with that.",
                "5 I dined here once while in NYC for a three day work trip, and I'm very glad I made it one of my three dinners in a city with hundreds of food options. First of all, I can very rarely find a restaurant in the United States that serves Super Bock on draft. I really enjoyed having this beer in Portugal last May but haven't had it since. This drink made the meal start off great. \n\nFor food, I will warn you to skip an appetizer if you aren't hungry. Our entrees came with a side of white rice and black beans. I'm not sure if this is typical. We were hungry, however, so we got the empanadas as an appetizer. My favorite was the cheese stuffed one, though the others were quite good too. Seemingly everything on the menu caught my eye, but when I asked our fantastic waiter for a recommendation between the few dishes I was considering, he recommended the bitoque. This is one of the restaurant's three \"classic\" dishes, and wow am I glad he pointed me in that direction. Though it wasn't the best steak I've ever had prepared, the garlic beer sauce was to die for. I used the potatoes that came with the dish as well as the black beans and white rice to soak up every bit of sauce. \n\nIf I'm back in the city any time soon, I would certianly consider going back to Ipanema. The great food, beer, and service (which I realize now I didn't mention before, but it was incredible) made for an excellent experience.",
                "5 I've eaten at Ipanema in Little Brazil the last two times my wife and I attended a Broadway show and both times it was excellent in both service and food. Of our two visits below is what I'd highly recommend you try...\n\nDrinks: Caipirinhas\nAppetizer: Pasteis\nEntree: Fraldinha, and/or Camarao Empanado",
                "4 Prices very reasonable for NYC. Atmosphere more like a diner however and noisy, service with Gabby so far so good. Classic Brazilian steak, picanha and skirt steak both recommended by Gabby, and she was right. Empanadas with heart-of-palm were quite delightful, beef ones too salty. The stuffed avocado with crab was OK, big portion. Margarita was so-so, not the place to order one, but they tried to make it right. House cabs both very good, Voces Cellars, CA was excellent at low price for city at $17/glass. Service was good, food was good, prices reasonable, what's not to like... I'd come back, but there are 1000 more restaurants to try first in NYC, but probably less than 500 in close walking distance from hotel :-)",
                "5 This place was fantastic! It was my first time ever having Brazilian food. I'm still thinking about it. My dish was so unique. I ordered the Bitoque, which was a New York strip steak with an egg on top, surrounded by a garlic beer sauce and fries. The steak was really good, not the best I've had, but it was cooked really well and had alot of juicy flavor. The sauce was amazing and tasted so much like brown gravy. It soaked really well with the fries. I was in garlic heaven eating this. The portion size was humongous but of course I finished everything because it was so good. My friend enjoyed her steak dinner too. We were pretty stuffed at the end. I wanted to try the Brazilian cheese bread but for the two of us, it came with too much bread since we already got complimentary bread service. I've heard it's a classic Brazilian thing so I hope to one day come back and try. The service was excellent, my water was always being refilled and we were treated very nicely by all waitstaff. I highly recommend this restaurant!",
                "4 The CHURRASCO IPANEMA is sooo good!\n\nWe made reservations for a weekend evening which I would recommend doing. The restaurant has clean modern look. Its dimly lit and has a bar right in front with a large dining area in the back and up the stairs.\n\nService is good. Our water glasses were constantly kept full and our orders were taken right away and food came out quick. \n\nI got the Churrasco ipanema which was a perfectly cooked medium rare NY strip topped with a good portion of shrimp and grab meat and delicious melted cheese. A really decadent surf and turf that taste amazing. I really enjoyed how light the while dish was. you would think its too much but the steak is seasoned perfectly and the crab shrimp cheese topping was surprisingly light. \n\nI'd definitely recommend giving this steak a try!",
                "5 If you are looking for a great Brazilian restaurant, head over to Ipanema. You will not be disappointed in any way. The food is incredible! We started with mixed salgadinhos (empanadas), which were delicious. We ordered The Picanha steak and the Vatapá ( shrimp in coconut  milk and palm oil), which was my absolute favorite.\nWhile the food was incredible, the service was beyond belief. My husband is from Rio, but our guests had never tried Brazilian food. Our waiter, Cadu, was amazing! So attentive, patient and informative, he really made our night.\nThanks to the entire staff for an incredible evening. We felt like family.",
                "5 I came here for my birthday dinner with a party of 6 and it was amazing! I wanted to do a dinner somewhere in the city and wanted ACTUAL good food over instagrammable places...did a little research on yelp and this place did not disappoint. \n\nFirst off, all the waiters/service were prompt and friendly. Upon learning it was my birthday, our server (not so discretely) asked my friend what my name was (stay with me it gets better). \n\nDinner was great, some friends got their most popular dish, the bitoque. I got the Churrasco Ipanema, and the melted cheese on top of the strip was honestly the cherry on top. In terms of drinks, I got the Ipanema cocktail (lime and passionfruit caipirinha). I'm biased because passionfruit is my all time favorite fruit, but that was the best cocktail I've ever had. \n\nAfter dinner cleared out, my friends surprised me with a cake (thanks guys!). After THAT, our server came in with a slice of flan and a bunch of them sang happy birthday in Portuguese to me...BUT THEY FORGOT MY NAME. Everyone had a good laugh at that. \n\nAll in all, a great birthday dinner experience with amazing food and service!! I'll be back for that cocktail!",
                "5 Wow! Amazing! \nI'm impressed with the food and the staff. Everybody was so nice and attentive.\nYou really have to try the Coxinhas and the Chicken Strogonoff was the best one I ever ate. Matheus is one of the best waiters ever! And as a dessert you guys really have to try the caramel flan.",
                "2 To be quite honest, I was not impressed. It is not the best Brazilian food that I've ever had in quality or flavor. \n\nVery quickly, it seemed that this restaurant is much more concerned with pumping through tables in volume than catering to them in quality. It was probably too close to Times Square, and I should've known better. Based on the reviews, I expected more.\n\nEverything for the food was dry like it had been sitting in a pot or under a lamp for quite a while. We got one drink from the bar. One cup of water each, and we were never offered anything additional to eat or drink. \n\nIt filled the void in our stomachs. With so many other options in Manhattan, I would recommend looking up one of them that is not within walking distance of Times Square, or chances are you will be equally as disappointed. \n\nIf you're just in need of an okay place or in a time crunch, this will fit the bill.",
                "4 Little hole in the wall of busy Times Square. Steak was juicy but a little tough. Mine was very cheesy (yum), but could've used more crab on top. Black beans were tasty. The fried bananas are a must! Side portion comes with 4 - so crispy and sweet. Sangria was A+ with tons of fruit and in a large mason jar. Decent service, romantic atmosphere. Prices are high, but would return.",
                "5 Excellent service and food. Went here with a Brazilian friend and this place did not disappoint. The feijoada was delicious and served with all the trimmings - chili peppers, rice, greens, a salty breadcrumb preparation and oranges. It was a feast and we shared one pot between the two of us. We also got assorted croquettes and shrimp in garlic sauce which were both delicious. The bread they provide is chewy and makes a great scoop for all the sauces. Recommend this place for a taste of Brazilian cuisine.",
                "3 Just came back from Vacation in Portugal and had extreme depression and was craving a pasteis de Nata. When I was in Portugal I would have like 2 to 3 a day (it's fine I did a lot of walking don't judge me). First order of business was to find a place near my job to get my fix. This place was about walking distance. \n\nI ordered an order of pasteis and an espresso on seamless . The pasteis is about 10$ and comes in 3. Unfortunately when I arrived to pick up they told me they don't do espresso to go...so I had to sit at the bar and chug my espresso then walk back to my office to eat my treats and that wasn't really the vibe I was going for. The pasteis were pretty good...obviously not the same and I get it but I got it out of my system.",
                "4 *WOULD RECOMMEND*\n\n\n\nWe visited Ipanema during 4th of July weekend before our broadway show and it was a good choice. The restaurant is two stories with a nice interior.The waiters were all very friendly and taught us how to pronounce some of the dishes. The menu was relatively small but all the food looked really good. I've never had Brazilian/Portuguese food (besides steak) but it all looks quite authentic to me. Their hot sauce is TO DIE FOR! It is homemade with fresh chilies, vinegar, and a lot of other ingredients I cannot pronounce. It started off a bit sweet and sour, followed by a kick of spice.I love sour so this hot sauce is right up my alley. The waiter even packed me a container of the hot sauce to take home. Service 10/10! \n\n*DINNER*\nPao de queijo - cheese bread. I thought it was going to be gooey, but it was actually was fluffy. I think they mixed the cheese into the dough. It was quite light and tasted very good with the hot sauce.\n\nPaelha - Brazilian/Portuguese version of paella. It had fresh clams, mussles, shrimp, chicken, sausage, and scallops, with a side of black bean sauce. All the seafood was fresh, especially the scallops (it was so tender). The rice itself didn't have as much depth in flavor as I'd hope. My friends all said they had better.\n\nFeijoada completa - national Brazilian dish. Basically black bean stew with a variety of meat and different sides (greens, breadcrumbs, and orange). The meat was alright, but the really dark looking one (I'm not sure which one that was) was really good. The combination of the stew with the sides was not bad. However, I do think there was a bit too much black bean to my liking. \n\nFlan - quite dense but pretty good\n\n\n*VERDICT*\nI would go back again and try their other food. This was just an introduction to Brazilian/Portuguese food for me outside of just steak.",
                "5 I don't think I knew how steak really was supposed to taste until today at Ipanema Restaurant. I've been to many restaurants, and been ok with their steak, \"the usual\" but these guys are something else. It was my first time there, so it was a bit difficult to read their menu. Luckily, Cadu helped me, and recommended nothing but the best steak I've ever tasted. Great customer service by Cadu. 10 stars for him.",
                "5 Easy same night dinner reservation, classy yet casual fun dining environment, and impeccable service that was professional, friendly, and efficient. Food and drinks that were unique and phenomenally flavorful in a creative comfort food where Mom loads too much on your plate sort of way.\n       My husband and I are glad we dined here for our first night in NYC dinner date ahead of a busy walking and Broadway itinerary day 2. We wish we'd had time for a second fabulous meal on our short first two day NYC visit. \n      The food and specialty drinks were so good! We hope to return and will recommend a meal here to any family members, friends, or acquaintances visiting NYC.",
                "4 Overall decent experience, I went here with a friend who recommended this place for lunch on a weekday afternoon.  The place had about 1-2 other tables with customers but later on in the evening more people came in, especially to the bar.\n\nComplimentary bread and butter was given at the beginning.  For the meal we had the Picanha which consisted of 3 pieces of a picanha cut of beef (a sort of special cut known in churrascarias that is known for a ring of fat lining the steak), rice, black beans. farofa (nutty flour mixture), fried potatoe coins, and a tangy salsa (not sure what it was called exactly but it helped brightened up the dish).  The picanha was well seasoned.  We also ordered the Churrasco Gaucho, which is another beef dish that came with fried potatoes.\n\nService was ok, we were seated immediately and the waitress asked if it's our first time eating, went over the specials, and asked if she can help answer any questions.  Water was refilled promptly (though a bit awkward since the waiter would hover around us for a few minutes before asking us for the refills).",
                "4 First time trying Portuguese and finding an authentic Brazilian/Portuguese restaurant that offers a great ambiance that's a little more upscale than the typical is sometimes hard to find even in New York. \n\nMy picanha was amazing, cooked perfectly the sauce was perfect and tasted home made. The Caipirinha and Sangria a plus!  \n\nFor dessert my friend and I shared and of course we had to try the Brazilian flan and Pasteis de Nata. One specialty of each country: Brazil and Portugal. And both were flavorful and well served and the flan was pretty big enough for two.\n\nThe staff is all very nice and welcoming. Love this place!",
                "1 This one hurts to write. I've been to Ipanema a few times and, frankly, always had a great experience with great food.\n\nToday started out no different - my wife and I went and had some good pao de queijo, picanha, bacalhau, rice and beans, etc. - the good stuff you want from a Brazilian restaurant.\n\nWe ordered dessert and the brigadeiros were not great - stale and frozen, so we sent them back and the waiter took them off our check. No biggie. \n\nWhere it all goes awry is later. We get home and my wife opens her leftover bacalhau and starts nomming. During mid-bite, a roach-like bug crawls out of the food (see the pic). That's just disgusting. Wife spits out her food, my stomach second-guesses what we ate today. Makes you wonder what kind of ingredients are in the food, if you catch my drift. Kitchen needs an inspection and we will never eat here again, and can only hope others take heed of our advice. Ugh. That sucked.",
                "5 This is a favorite for my family and I. We're Portuguese and finding an authentic Brazilian/Portuguese restaurant that offers a great ambience that's a little more upscale than the typical is sometimes hard. My picanha was amazing, cooked perfectly, my dad loved his polvo, my mom and bf also loved their bitoque, the sauce was perfect and tasted home made. The Cartuxa wine was great, along with the caipirinha and sangria! For dessert we had the pastéis de nata, doce da casa (my personal favorite), and tres leches. The waiter was funny and very interactive. The staff is all very nice and welcoming. Love this place!!",
                "4 To start, things went terribly. There was lipstick on my friends water glass when we sat down (spoiler alert, it wasn't hers) and the bread they serve might be the worst bread I have ever had at a restaurant. Not only that, but the butter packets they serve with it might be the worst butter packets I have ever had as well. I thought to myself uh oh, this will be terrible. \n\nBut after that things got better. Our service was fairly quick and we both enjoyed our food. My friend got the bitoque and I got the vatapa. Both were tasty and we both enjoyed ourselves. We got their fried bananas which neither of us liked. Too fried and not tasty. I wouldn't order it again. But their flan dessert was amazing. It was a great texture and just delightful. I really recommend the flan - star of the night. \n\nQuick service and good food, just improve the bread and the sanitary aspect for 5 stars. Seriously about the bread, don't have bread if it's going to be that poor of quality. I really hope they read this so they stop with that.",
                "5 I dined here once while in NYC for a three day work trip, and I'm very glad I made it one of my three dinners in a city with hundreds of food options. First of all, I can very rarely find a restaurant in the United States that serves Super Bock on draft. I really enjoyed having this beer in Portugal last May but haven't had it since. This drink made the meal start off great. \n\nFor food, I will warn you to skip an appetizer if you aren't hungry. Our entrees came with a side of white rice and black beans. I'm not sure if this is typical. We were hungry, however, so we got the empanadas as an appetizer. My favorite was the cheese stuffed one, though the others were quite good too. Seemingly everything on the menu caught my eye, but when I asked our fantastic waiter for a recommendation between the few dishes I was considering, he recommended the bitoque. This is one of the restaurant's three \"classic\" dishes, and wow am I glad he pointed me in that direction. Though it wasn't the best steak I've ever had prepared, the garlic beer sauce was to die for. I used the potatoes that came with the dish as well as the black beans and white rice to soak up every bit of sauce. \n\nIf I'm back in the city any time soon, I would certianly consider going back to Ipanema. The great food, beer, and service (which I realize now I didn't mention before, but it was incredible) made for an excellent experience.",
                "5 I've eaten at Ipanema in Little Brazil the last two times my wife and I attended a Broadway show and both times it was excellent in both service and food. Of our two visits below is what I'd highly recommend you try...\n\nDrinks: Caipirinhas\nAppetizer: Pasteis\nEntree: Fraldinha, and/or Camarao Empanado",
                "4 Prices very reasonable for NYC. Atmosphere more like a diner however and noisy, service with Gabby so far so good. Classic Brazilian steak, picanha and skirt steak both recommended by Gabby, and she was right. Empanadas with heart-of-palm were quite delightful, beef ones too salty. The stuffed avocado with crab was OK, big portion. Margarita was so-so, not the place to order one, but they tried to make it right. House cabs both very good, Voces Cellars, CA was excellent at low price for city at $17/glass. Service was good, food was good, prices reasonable, what's not to like... I'd come back, but there are 1000 more restaurants to try first in NYC, but probably less than 500 in close walking distance from hotel :-)",
                "5 This place was fantastic! It was my first time ever having Brazilian food. I'm still thinking about it. My dish was so unique. I ordered the Bitoque, which was a New York strip steak with an egg on top, surrounded by a garlic beer sauce and fries. The steak was really good, not the best I've had, but it was cooked really well and had alot of juicy flavor. The sauce was amazing and tasted so much like brown gravy. It soaked really well with the fries. I was in garlic heaven eating this. The portion size was humongous but of course I finished everything because it was so good. My friend enjoyed her steak dinner too. We were pretty stuffed at the end. I wanted to try the Brazilian cheese bread but for the two of us, it came with too much bread since we already got complimentary bread service. I've heard it's a classic Brazilian thing so I hope to one day come back and try. The service was excellent, my water was always being refilled and we were treated very nicely by all waitstaff. I highly recommend this restaurant!",
                "4 The CHURRASCO IPANEMA is sooo good!\n\nWe made reservations for a weekend evening which I would recommend doing. The restaurant has clean modern look. Its dimly lit and has a bar right in front with a large dining area in the back and up the stairs.\n\nService is good. Our water glasses were constantly kept full and our orders were taken right away and food came out quick. \n\nI got the Churrasco ipanema which was a perfectly cooked medium rare NY strip topped with a good portion of shrimp and grab meat and delicious melted cheese. A really decadent surf and turf that taste amazing. I really enjoyed how light the while dish was. you would think its too much but the steak is seasoned perfectly and the crab shrimp cheese topping was surprisingly light. \n\nI'd definitely recommend giving this steak a try!",
                "5 If you are looking for a great Brazilian restaurant, head over to Ipanema. You will not be disappointed in any way. The food is incredible! We started with mixed salgadinhos (empanadas), which were delicious. We ordered The Picanha steak and the Vatapá ( shrimp in coconut  milk and palm oil), which was my absolute favorite.\nWhile the food was incredible, the service was beyond belief. My husband is from Rio, but our guests had never tried Brazilian food. Our waiter, Cadu, was amazing! So attentive, patient and informative, he really made our night.\nThanks to the entire staff for an incredible evening. We felt like family.",
                "5 I came here for my birthday dinner with a party of 6 and it was amazing! I wanted to do a dinner somewhere in the city and wanted ACTUAL good food over instagrammable places...did a little research on yelp and this place did not disappoint. \n\nFirst off, all the waiters/service were prompt and friendly. Upon learning it was my birthday, our server (not so discretely) asked my friend what my name was (stay with me it gets better). \n\nDinner was great, some friends got their most popular dish, the bitoque. I got the Churrasco Ipanema, and the melted cheese on top of the strip was honestly the cherry on top. In terms of drinks, I got the Ipanema cocktail (lime and passionfruit caipirinha). I'm biased because passionfruit is my all time favorite fruit, but that was the best cocktail I've ever had. \n\nAfter dinner cleared out, my friends surprised me with a cake (thanks guys!). After THAT, our server came in with a slice of flan and a bunch of them sang happy birthday in Portuguese to me...BUT THEY FORGOT MY NAME. Everyone had a good laugh at that. \n\nAll in all, a great birthday dinner experience with amazing food and service!! I'll be back for that cocktail!",
                "5 Wow! Amazing! \nI'm impressed with the food and the staff. Everybody was so nice and attentive.\nYou really have to try the Coxinhas and the Chicken Strogonoff was the best one I ever ate. Matheus is one of the best waiters ever! And as a dessert you guys really have to try the caramel flan.",
                "2 To be quite honest, I was not impressed. It is not the best Brazilian food that I've ever had in quality or flavor. \n\nVery quickly, it seemed that this restaurant is much more concerned with pumping through tables in volume than catering to them in quality. It was probably too close to Times Square, and I should've known better. Based on the reviews, I expected more.\n\nEverything for the food was dry like it had been sitting in a pot or under a lamp for quite a while. We got one drink from the bar. One cup of water each, and we were never offered anything additional to eat or drink. \n\nIt filled the void in our stomachs. With so many other options in Manhattan, I would recommend looking up one of them that is not within walking distance of Times Square, or chances are you will be equally as disappointed. \n\nIf you're just in need of an okay place or in a time crunch, this will fit the bill.",
                "4 Little hole in the wall of busy Times Square. Steak was juicy but a little tough. Mine was very cheesy (yum), but could've used more crab on top. Black beans were tasty. The fried bananas are a must! Side portion comes with 4 - so crispy and sweet. Sangria was A+ with tons of fruit and in a large mason jar. Decent service, romantic atmosphere. Prices are high, but would return.",
                "5 Excellent service and food. Went here with a Brazilian friend and this place did not disappoint. The feijoada was delicious and served with all the trimmings - chili peppers, rice, greens, a salty breadcrumb preparation and oranges. It was a feast and we shared one pot between the two of us. We also got assorted croquettes and shrimp in garlic sauce which were both delicious. The bread they provide is chewy and makes a great scoop for all the sauces. Recommend this place for a taste of Brazilian cuisine.",
                "3 Just came back from Vacation in Portugal and had extreme depression and was craving a pasteis de Nata. When I was in Portugal I would have like 2 to 3 a day (it's fine I did a lot of walking don't judge me). First order of business was to find a place near my job to get my fix. This place was about walking distance. \n\nI ordered an order of pasteis and an espresso on seamless . The pasteis is about 10$ and comes in 3. Unfortunately when I arrived to pick up they told me they don't do espresso to go...so I had to sit at the bar and chug my espresso then walk back to my office to eat my treats and that wasn't really the vibe I was going for. The pasteis were pretty good...obviously not the same and I get it but I got it out of my system.",
                "4 *WOULD RECOMMEND*\n\n\n\nWe visited Ipanema during 4th of July weekend before our broadway show and it was a good choice. The restaurant is two stories with a nice interior.The waiters were all very friendly and taught us how to pronounce some of the dishes. The menu was relatively small but all the food looked really good. I've never had Brazilian/Portuguese food (besides steak) but it all looks quite authentic to me. Their hot sauce is TO DIE FOR! It is homemade with fresh chilies, vinegar, and a lot of other ingredients I cannot pronounce. It started off a bit sweet and sour, followed by a kick of spice.I love sour so this hot sauce is right up my alley. The waiter even packed me a container of the hot sauce to take home. Service 10/10! \n\n*DINNER*\nPao de queijo - cheese bread. I thought it was going to be gooey, but it was actually was fluffy. I think they mixed the cheese into the dough. It was quite light and tasted very good with the hot sauce.\n\nPaelha - Brazilian/Portuguese version of paella. It had fresh clams, mussles, shrimp, chicken, sausage, and scallops, with a side of black bean sauce. All the seafood was fresh, especially the scallops (it was so tender). The rice itself didn't have as much depth in flavor as I'd hope. My friends all said they had better.\n\nFeijoada completa - national Brazilian dish. Basically black bean stew with a variety of meat and different sides (greens, breadcrumbs, and orange). The meat was alright, but the really dark looking one (I'm not sure which one that was) was really good. The combination of the stew with the sides was not bad. However, I do think there was a bit too much black bean to my liking. \n\nFlan - quite dense but pretty good\n\n\n*VERDICT*\nI would go back again and try their other food. This was just an introduction to Brazilian/Portuguese food for me outside of just steak.",
                "5 I don't think I knew how steak really was supposed to taste until today at Ipanema Restaurant. I've been to many restaurants, and been ok with their steak, \"the usual\" but these guys are something else. It was my first time there, so it was a bit difficult to read their menu. Luckily, Cadu helped me, and recommended nothing but the best steak I've ever tasted. Great customer service by Cadu. 10 stars for him.",
                "5 Easy same night dinner reservation, classy yet casual fun dining environment, and impeccable service that was professional, friendly, and efficient. Food and drinks that were unique and phenomenally flavorful in a creative comfort food where Mom loads too much on your plate sort of way.\n       My husband and I are glad we dined here for our first night in NYC dinner date ahead of a busy walking and Broadway itinerary day 2. We wish we'd had time for a second fabulous meal on our short first two day NYC visit. \n      The food and specialty drinks were so good! We hope to return and will recommend a meal here to any family members, friends, or acquaintances visiting NYC.",
                "4 Overall decent experience, I went here with a friend who recommended this place for lunch on a weekday afternoon.  The place had about 1-2 other tables with customers but later on in the evening more people came in, especially to the bar.\n\nComplimentary bread and butter was given at the beginning.  For the meal we had the Picanha which consisted of 3 pieces of a picanha cut of beef (a sort of special cut known in churrascarias that is known for a ring of fat lining the steak), rice, black beans. farofa (nutty flour mixture), fried potatoe coins, and a tangy salsa (not sure what it was called exactly but it helped brightened up the dish).  The picanha was well seasoned.  We also ordered the Churrasco Gaucho, which is another beef dish that came with fried potatoes.\n\nService was ok, we were seated immediately and the waitress asked if it's our first time eating, went over the specials, and asked if she can help answer any questions.  Water was refilled promptly (though a bit awkward since the waiter would hover around us for a few minutes before asking us for the refills).",
                "4 First time trying Portuguese and finding an authentic Brazilian/Portuguese restaurant that offers a great ambiance that's a little more upscale than the typical is sometimes hard to find even in New York. \n\nMy picanha was amazing, cooked perfectly the sauce was perfect and tasted home made. The Caipirinha and Sangria a plus!  \n\nFor dessert my friend and I shared and of course we had to try the Brazilian flan and Pasteis de Nata. One specialty of each country: Brazil and Portugal. And both were flavorful and well served and the flan was pretty big enough for two.\n\nThe staff is all very nice and welcoming. Love this place!",
                "1 This one hurts to write. I've been to Ipanema a few times and, frankly, always had a great experience with great food.\n\nToday started out no different - my wife and I went and had some good pao de queijo, picanha, bacalhau, rice and beans, etc. - the good stuff you want from a Brazilian restaurant.\n\nWe ordered dessert and the brigadeiros were not great - stale and frozen, so we sent them back and the waiter took them off our check. No biggie. \n\nWhere it all goes awry is later. We get home and my wife opens her leftover bacalhau and starts nomming. During mid-bite, a roach-like bug crawls out of the food (see the pic). That's just disgusting. Wife spits out her food, my stomach second-guesses what we ate today. Makes you wonder what kind of ingredients are in the food, if you catch my drift. Kitchen needs an inspection and we will never eat here again, and can only hope others take heed of our advice. Ugh. That sucked.",
                "5 This is a favorite for my family and I. We're Portuguese and finding an authentic Brazilian/Portuguese restaurant that offers a great ambience that's a little more upscale than the typical is sometimes hard. My picanha was amazing, cooked perfectly, my dad loved his polvo, my mom and bf also loved their bitoque, the sauce was perfect and tasted home made. The Cartuxa wine was great, along with the caipirinha and sangria! For dessert we had the pastéis de nata, doce da casa (my personal favorite), and tres leches. The waiter was funny and very interactive. The staff is all very nice and welcoming. Love this place!!",
                "4 To start, things went terribly. There was lipstick on my friends water glass when we sat down (spoiler alert, it wasn't hers) and the bread they serve might be the worst bread I have ever had at a restaurant. Not only that, but the butter packets they serve with it might be the worst butter packets I have ever had as well. I thought to myself uh oh, this will be terrible. \n\nBut after that things got better. Our service was fairly quick and we both enjoyed our food. My friend got the bitoque and I got the vatapa. Both were tasty and we both enjoyed ourselves. We got their fried bananas which neither of us liked. Too fried and not tasty. I wouldn't order it again. But their flan dessert was amazing. It was a great texture and just delightful. I really recommend the flan - star of the night. \n\nQuick service and good food, just improve the bread and the sanitary aspect for 5 stars. Seriously about the bread, don't have bread if it's going to be that poor of quality. I really hope they read this so they stop with that.",
                "5 I dined here once while in NYC for a three day work trip, and I'm very glad I made it one of my three dinners in a city with hundreds of food options. First of all, I can very rarely find a restaurant in the United States that serves Super Bock on draft. I really enjoyed having this beer in Portugal last May but haven't had it since. This drink made the meal start off great. \n\nFor food, I will warn you to skip an appetizer if you aren't hungry. Our entrees came with a side of white rice and black beans. I'm not sure if this is typical. We were hungry, however, so we got the empanadas as an appetizer. My favorite was the cheese stuffed one, though the others were quite good too. Seemingly everything on the menu caught my eye, but when I asked our fantastic waiter for a recommendation between the few dishes I was considering, he recommended the bitoque. This is one of the restaurant's three \"classic\" dishes, and wow am I glad he pointed me in that direction. Though it wasn't the best steak I've ever had prepared, the garlic beer sauce was to die for. I used the potatoes that came with the dish as well as the black beans and white rice to soak up every bit of sauce. \n\nIf I'm back in the city any time soon, I would certianly consider going back to Ipanema. The great food, beer, and service (which I realize now I didn't mention before, but it was incredible) made for an excellent experience.",
                "5 I've eaten at Ipanema in Little Brazil the last two times my wife and I attended a Broadway show and both times it was excellent in both service and food. Of our two visits below is what I'd highly recommend you try...\n\nDrinks: Caipirinhas\nAppetizer: Pasteis\nEntree: Fraldinha, and/or Camarao Empanado",
                "4 Prices very reasonable for NYC. Atmosphere more like a diner however and noisy, service with Gabby so far so good. Classic Brazilian steak, picanha and skirt steak both recommended by Gabby, and she was right. Empanadas with heart-of-palm were quite delightful, beef ones too salty. The stuffed avocado with crab was OK, big portion. Margarita was so-so, not the place to order one, but they tried to make it right. House cabs both very good, Voces Cellars, CA was excellent at low price for city at $17/glass. Service was good, food was good, prices reasonable, what's not to like... I'd come back, but there are 1000 more restaurants to try first in NYC, but probably less than 500 in close walking distance from hotel :-)",
                "5 This place was fantastic! It was my first time ever having Brazilian food. I'm still thinking about it. My dish was so unique. I ordered the Bitoque, which was a New York strip steak with an egg on top, surrounded by a garlic beer sauce and fries. The steak was really good, not the best I've had, but it was cooked really well and had alot of juicy flavor. The sauce was amazing and tasted so much like brown gravy. It soaked really well with the fries. I was in garlic heaven eating this. The portion size was humongous but of course I finished everything because it was so good. My friend enjoyed her steak dinner too. We were pretty stuffed at the end. I wanted to try the Brazilian cheese bread but for the two of us, it came with too much bread since we already got complimentary bread service. I've heard it's a classic Brazilian thing so I hope to one day come back and try. The service was excellent, my water was always being refilled and we were treated very nicely by all waitstaff. I highly recommend this restaurant!",
                "4 The CHURRASCO IPANEMA is sooo good!\n\nWe made reservations for a weekend evening which I would recommend doing. The restaurant has clean modern look. Its dimly lit and has a bar right in front with a large dining area in the back and up the stairs.\n\nService is good. Our water glasses were constantly kept full and our orders were taken right away and food came out quick. \n\nI got the Churrasco ipanema which was a perfectly cooked medium rare NY strip topped with a good portion of shrimp and grab meat and delicious melted cheese. A really decadent surf and turf that taste amazing. I really enjoyed how light the while dish was. you would think its too much but the steak is seasoned perfectly and the crab shrimp cheese topping was surprisingly light. \n\nI'd definitely recommend giving this steak a try!",
                "5 If you are looking for a great Brazilian restaurant, head over to Ipanema. You will not be disappointed in any way. The food is incredible! We started with mixed salgadinhos (empanadas), which were delicious. We ordered The Picanha steak and the Vatapá ( shrimp in coconut  milk and palm oil), which was my absolute favorite.\nWhile the food was incredible, the service was beyond belief. My husband is from Rio, but our guests had never tried Brazilian food. Our waiter, Cadu, was amazing! So attentive, patient and informative, he really made our night.\nThanks to the entire staff for an incredible evening. We felt like family.",
                "5 I came here for my birthday dinner with a party of 6 and it was amazing! I wanted to do a dinner somewhere in the city and wanted ACTUAL good food over instagrammable places...did a little research on yelp and this place did not disappoint. \n\nFirst off, all the waiters/service were prompt and friendly. Upon learning it was my birthday, our server (not so discretely) asked my friend what my name was (stay with me it gets better). \n\nDinner was great, some friends got their most popular dish, the bitoque. I got the Churrasco Ipanema, and the melted cheese on top of the strip was honestly the cherry on top. In terms of drinks, I got the Ipanema cocktail (lime and passionfruit caipirinha). I'm biased because passionfruit is my all time favorite fruit, but that was the best cocktail I've ever had. \n\nAfter dinner cleared out, my friends surprised me with a cake (thanks guys!). After THAT, our server came in with a slice of flan and a bunch of them sang happy birthday in Portuguese to me...BUT THEY FORGOT MY NAME. Everyone had a good laugh at that. \n\nAll in all, a great birthday dinner experience with amazing food and service!! I'll be back for that cocktail!",
                "5 Wow! Amazing! \nI'm impressed with the food and the staff. Everybody was so nice and attentive.\nYou really have to try the Coxinhas and the Chicken Strogonoff was the best one I ever ate. Matheus is one of the best waiters ever! And as a dessert you guys really have to try the caramel flan.",
                "2 To be quite honest, I was not impressed. It is not the best Brazilian food that I've ever had in quality or flavor. \n\nVery quickly, it seemed that this restaurant is much more concerned with pumping through tables in volume than catering to them in quality. It was probably too close to Times Square, and I should've known better. Based on the reviews, I expected more.\n\nEverything for the food was dry like it had been sitting in a pot or under a lamp for quite a while. We got one drink from the bar. One cup of water each, and we were never offered anything additional to eat or drink. \n\nIt filled the void in our stomachs. With so many other options in Manhattan, I would recommend looking up one of them that is not within walking distance of Times Square, or chances are you will be equally as disappointed. \n\nIf you're just in need of an okay place or in a time crunch, this will fit the bill.",
                "4 Little hole in the wall of busy Times Square. Steak was juicy but a little tough. Mine was very cheesy (yum), but could've used more crab on top. Black beans were tasty. The fried bananas are a must! Side portion comes with 4 - so crispy and sweet. Sangria was A+ with tons of fruit and in a large mason jar. Decent service, romantic atmosphere. Prices are high, but would return.",
                "5 Excellent service and food. Went here with a Brazilian friend and this place did not disappoint. The feijoada was delicious and served with all the trimmings - chili peppers, rice, greens, a salty breadcrumb preparation and oranges. It was a feast and we shared one pot between the two of us. We also got assorted croquettes and shrimp in garlic sauce which were both delicious. The bread they provide is chewy and makes a great scoop for all the sauces. Recommend this place for a taste of Brazilian cuisine.",
                "3 Just came back from Vacation in Portugal and had extreme depression and was craving a pasteis de Nata. When I was in Portugal I would have like 2 to 3 a day (it's fine I did a lot of walking don't judge me). First order of business was to find a place near my job to get my fix. This place was about walking distance. \n\nI ordered an order of pasteis and an espresso on seamless . The pasteis is about 10$ and comes in 3. Unfortunately when I arrived to pick up they told me they don't do espresso to go...so I had to sit at the bar and chug my espresso then walk back to my office to eat my treats and that wasn't really the vibe I was going for. The pasteis were pretty good...obviously not the same and I get it but I got it out of my system.",
                "4 *WOULD RECOMMEND*\n\n\n\nWe visited Ipanema during 4th of July weekend before our broadway show and it was a good choice. The restaurant is two stories with a nice interior.The waiters were all very friendly and taught us how to pronounce some of the dishes. The menu was relatively small but all the food looked really good. I've never had Brazilian/Portuguese food (besides steak) but it all looks quite authentic to me. Their hot sauce is TO DIE FOR! It is homemade with fresh chilies, vinegar, and a lot of other ingredients I cannot pronounce. It started off a bit sweet and sour, followed by a kick of spice.I love sour so this hot sauce is right up my alley. The waiter even packed me a container of the hot sauce to take home. Service 10/10! \n\n*DINNER*\nPao de queijo - cheese bread. I thought it was going to be gooey, but it was actually was fluffy. I think they mixed the cheese into the dough. It was quite light and tasted very good with the hot sauce.\n\nPaelha - Brazilian/Portuguese version of paella. It had fresh clams, mussles, shrimp, chicken, sausage, and scallops, with a side of black bean sauce. All the seafood was fresh, especially the scallops (it was so tender). The rice itself didn't have as much depth in flavor as I'd hope. My friends all said they had better.\n\nFeijoada completa - national Brazilian dish. Basically black bean stew with a variety of meat and different sides (greens, breadcrumbs, and orange). The meat was alright, but the really dark looking one (I'm not sure which one that was) was really good. The combination of the stew with the sides was not bad. However, I do think there was a bit too much black bean to my liking. \n\nFlan - quite dense but pretty good\n\n\n*VERDICT*\nI would go back again and try their other food. This was just an introduction to Brazilian/Portuguese food for me outside of just steak.",
                "5 I don't think I knew how steak really was supposed to taste until today at Ipanema Restaurant. I've been to many restaurants, and been ok with their steak, \"the usual\" but these guys are something else. It was my first time there, so it was a bit difficult to read their menu. Luckily, Cadu helped me, and recommended nothing but the best steak I've ever tasted. Great customer service by Cadu. 10 stars for him.",
                "5 Easy same night dinner reservation, classy yet casual fun dining environment, and impeccable service that was professional, friendly, and efficient. Food and drinks that were unique and phenomenally flavorful in a creative comfort food where Mom loads too much on your plate sort of way.\n       My husband and I are glad we dined here for our first night in NYC dinner date ahead of a busy walking and Broadway itinerary day 2. We wish we'd had time for a second fabulous meal on our short first two day NYC visit. \n      The food and specialty drinks were so good! We hope to return and will recommend a meal here to any family members, friends, or acquaintances visiting NYC.",
                "4 Overall decent experience, I went here with a friend who recommended this place for lunch on a weekday afternoon.  The place had about 1-2 other tables with customers but later on in the evening more people came in, especially to the bar.\n\nComplimentary bread and butter was given at the beginning.  For the meal we had the Picanha which consisted of 3 pieces of a picanha cut of beef (a sort of special cut known in churrascarias that is known for a ring of fat lining the steak), rice, black beans. farofa (nutty flour mixture), fried potatoe coins, and a tangy salsa (not sure what it was called exactly but it helped brightened up the dish).  The picanha was well seasoned.  We also ordered the Churrasco Gaucho, which is another beef dish that came with fried potatoes.\n\nService was ok, we were seated immediately and the waitress asked if it's our first time eating, went over the specials, and asked if she can help answer any questions.  Water was refilled promptly (though a bit awkward since the waiter would hover around us for a few minutes before asking us for the refills).",
                "4 First time trying Portuguese and finding an authentic Brazilian/Portuguese restaurant that offers a great ambiance that's a little more upscale than the typical is sometimes hard to find even in New York. \n\nMy picanha was amazing, cooked perfectly the sauce was perfect and tasted home made. The Caipirinha and Sangria a plus!  \n\nFor dessert my friend and I shared and of course we had to try the Brazilian flan and Pasteis de Nata. One specialty of each country: Brazil and Portugal. And both were flavorful and well served and the flan was pretty big enough for two.\n\nThe staff is all very nice and welcoming. Love this place!",
                "1 This one hurts to write. I've been to Ipanema a few times and, frankly, always had a great experience with great food.\n\nToday started out no different - my wife and I went and had some good pao de queijo, picanha, bacalhau, rice and beans, etc. - the good stuff you want from a Brazilian restaurant.\n\nWe ordered dessert and the brigadeiros were not great - stale and frozen, so we sent them back and the waiter took them off our check. No biggie. \n\nWhere it all goes awry is later. We get home and my wife opens her leftover bacalhau and starts nomming. During mid-bite, a roach-like bug crawls out of the food (see the pic). That's just disgusting. Wife spits out her food, my stomach second-guesses what we ate today. Makes you wonder what kind of ingredients are in the food, if you catch my drift. Kitchen needs an inspection and we will never eat here again, and can only hope others take heed of our advice. Ugh. That sucked.",
                "5 This is a favorite for my family and I. We're Portuguese and finding an authentic Brazilian/Portuguese restaurant that offers a great ambience that's a little more upscale than the typical is sometimes hard. My picanha was amazing, cooked perfectly, my dad loved his polvo, my mom and bf also loved their bitoque, the sauce was perfect and tasted home made. The Cartuxa wine was great, along with the caipirinha and sangria! For dessert we had the pastéis de nata, doce da casa (my personal favorite), and tres leches. The waiter was funny and very interactive. The staff is all very nice and welcoming. Love this place!!",
                "4 To start, things went terribly. There was lipstick on my friends water glass when we sat down (spoiler alert, it wasn't hers) and the bread they serve might be the worst bread I have ever had at a restaurant. Not only that, but the butter packets they serve with it might be the worst butter packets I have ever had as well. I thought to myself uh oh, this will be terrible. \n\nBut after that things got better. Our service was fairly quick and we both enjoyed our food. My friend got the bitoque and I got the vatapa. Both were tasty and we both enjoyed ourselves. We got their fried bananas which neither of us liked. Too fried and not tasty. I wouldn't order it again. But their flan dessert was amazing. It was a great texture and just delightful. I really recommend the flan - star of the night. \n\nQuick service and good food, just improve the bread and the sanitary aspect for 5 stars. Seriously about the bread, don't have bread if it's going to be that poor of quality. I really hope they read this so they stop with that.",
                "5 I dined here once while in NYC for a three day work trip, and I'm very glad I made it one of my three dinners in a city with hundreds of food options. First of all, I can very rarely find a restaurant in the United States that serves Super Bock on draft. I really enjoyed having this beer in Portugal last May but haven't had it since. This drink made the meal start off great. \n\nFor food, I will warn you to skip an appetizer if you aren't hungry. Our entrees came with a side of white rice and black beans. I'm not sure if this is typical. We were hungry, however, so we got the empanadas as an appetizer. My favorite was the cheese stuffed one, though the others were quite good too. Seemingly everything on the menu caught my eye, but when I asked our fantastic waiter for a recommendation between the few dishes I was considering, he recommended the bitoque. This is one of the restaurant's three \"classic\" dishes, and wow am I glad he pointed me in that direction. Though it wasn't the best steak I've ever had prepared, the garlic beer sauce was to die for. I used the potatoes that came with the dish as well as the black beans and white rice to soak up every bit of sauce. \n\nIf I'm back in the city any time soon, I would certianly consider going back to Ipanema. The great food, beer, and service (which I realize now I didn't mention before, but it was incredible) made for an excellent experience.",
                "5 I've eaten at Ipanema in Little Brazil the last two times my wife and I attended a Broadway show and both times it was excellent in both service and food. Of our two visits below is what I'd highly recommend you try...\n\nDrinks: Caipirinhas\nAppetizer: Pasteis\nEntree: Fraldinha, and/or Camarao Empanado",
                "4 Prices very reasonable for NYC. Atmosphere more like a diner however and noisy, service with Gabby so far so good. Classic Brazilian steak, picanha and skirt steak both recommended by Gabby, and she was right. Empanadas with heart-of-palm were quite delightful, beef ones too salty. The stuffed avocado with crab was OK, big portion. Margarita was so-so, not the place to order one, but they tried to make it right. House cabs both very good, Voces Cellars, CA was excellent at low price for city at $17/glass. Service was good, food was good, prices reasonable, what's not to like... I'd come back, but there are 1000 more restaurants to try first in NYC, but probably less than 500 in close walking distance from hotel :-)",
                "5 This place was fantastic! It was my first time ever having Brazilian food. I'm still thinking about it. My dish was so unique. I ordered the Bitoque, which was a New York strip steak with an egg on top, surrounded by a garlic beer sauce and fries. The steak was really good, not the best I've had, but it was cooked really well and had alot of juicy flavor. The sauce was amazing and tasted so much like brown gravy. It soaked really well with the fries. I was in garlic heaven eating this. The portion size was humongous but of course I finished everything because it was so good. My friend enjoyed her steak dinner too. We were pretty stuffed at the end. I wanted to try the Brazilian cheese bread but for the two of us, it came with too much bread since we already got complimentary bread service. I've heard it's a classic Brazilian thing so I hope to one day come back and try. The service was excellent, my water was always being refilled and we were treated very nicely by all waitstaff. I highly recommend this restaurant!",
                "4 The CHURRASCO IPANEMA is sooo good!\n\nWe made reservations for a weekend evening which I would recommend doing. The restaurant has clean modern look. Its dimly lit and has a bar right in front with a large dining area in the back and up the stairs.\n\nService is good. Our water glasses were constantly kept full and our orders were taken right away and food came out quick. \n\nI got the Churrasco ipanema which was a perfectly cooked medium rare NY strip topped with a good portion of shrimp and grab meat and delicious melted cheese. A really decadent surf and turf that taste amazing. I really enjoyed how light the while dish was. you would think its too much but the steak is seasoned perfectly and the crab shrimp cheese topping was surprisingly light. \n\nI'd definitely recommend giving this steak a try!",
                "5 If you are looking for a great Brazilian restaurant, head over to Ipanema. You will not be disappointed in any way. The food is incredible! We started with mixed salgadinhos (empanadas), which were delicious. We ordered The Picanha steak and the Vatapá ( shrimp in coconut  milk and palm oil), which was my absolute favorite.\nWhile the food was incredible, the service was beyond belief. My husband is from Rio, but our guests had never tried Brazilian food. Our waiter, Cadu, was amazing! So attentive, patient and informative, he really made our night.\nThanks to the entire staff for an incredible evening. We felt like family."
            ]
        }
    ]
}